{
  "Agriculture_And_Nutrion_Grade_8.pdf": {
    "subject": "Agriculture And Nutrion",
    "grade": 8,
    "strand": "2.0 FOOD PRODUCTION PROCESSES",
    "substrand": "",
    "learning_outcomes": [],
    "key_inquiry_questions": [
      "purposes?",
      "production?",
      "diseases?",
      "fresh fish?",
      "carcass?",
      "the kitchen?",
      "using seams?",
      "animals?",
      "How can we control pests and diseases affecting crops?",
      "How can we dress poultry carcass?"
    ],
    "core_competencies": [
      "Critical thinking and problem solving: open-mindedness and creativity skills as learners analyse and initiate water harvesting and",
      " critical thinking skills as they establish kitchen",
      "Critical thinking and problem solving: evaluation and decision skills as the learners establish a kitchen or a",
      " creativity skills as learners apply ideas in constructing a",
      "Creativity and imagination: networking skills as learners undertake group task and gain new perspective on",
      " learning to learn by applying collaborative skills",
      "Learning to learn: learners carry out research during field excursion to identify vegetable crop pests and diseases.",
      " learning to learn as learners collaboratively",
      "Learning to learn: collaborative working as learners undertake processing of fish and poultry.",
      " digital literacy as learners search for",
      "Digital literacy: interacting with digital technology as learners search for information on milk and meat",
      " creativity skills while presenting meals,",
      "Creativity and imagination: networking skills as learners share new ideas that inspire creative thinking in",
      "meal) with creativity and",
      " learning to learn while applying appropriate",
      "Learning to learn: organizing own learning as learners apply appropriate procedures in cleaning the kitchen.",
      "Creativity and imagination: experimenting skills as learners construct household items using seams.",
      "Critical thinking and problem solving: reflection skills as learners develop innovative waterers for domestic animals.",
      " digital literacy as learners apply digital citizenship",
      "Digital literacy: digital citizenship skills as learners access online platform for ICT support services."
    ],
    "values": [
      "c) show responsibility",
      "responsibility in initiating and maintaining",
      "Responsibility: learners undertake assigned roles while participating in water harvesting and storage initiatives in the school.",
      "Learners relate water harvesting and storage to conservation of the community environment learnt in social studies.",
      "responsibility in",
      "aspects of responsibility",
      "of responsibility",
      "unity as they collaborate to establish the",
      "Unity: collaboration with others while learners establish a kitchen or backyard garden.",
      "poultry fold, responsibility as they carry out assigned",
      "Responsibility: carrying out assigned tasks in the project for construction of a poultry fold.",
      "in controlling pests and diseases, value of respect",
      "Respect: accommodating diverse opinions while learners discuss and make presentations on the importance of controlling pests",
      "process fish, integrity as learners apply ethical",
      "methods of dressing poultry and ensures respect",
      "Integrity: application of ethical procedures in the processing of fish and poultry.",
      "information, integrity as learners display",
      "honesty in preserving meat and milk in",
      "Integrity: honesty in the process of preserving meat and milk using ethically acceptable procedures.",
      "integrity in the use of resources to prepare the"
    ],
    "suggested_learning_experiences": [
      "to extend knowledge and create awareness to the school community. 25 vegetables.",
      "Practices  Written test  Oral assessment on safety when handling animal.  Observation of learning  Oral tests  Project  Activity journals",
      "Learners to use existing school forums to sensitize the school community on hygiene practices. 4.0 Production",
      "Learners to use existing school forums to create awareness and enhance adoption of various production techniques.",
      "a) discuss ways of",
      "Learners are guided to:",
      "Critical thinking and problem solving: open-mindedness and creativity skills as learners analyse and initiate water harvesting and",
      "Responsibility: learners undertake assigned roles while participating in water harvesting and storage initiatives in the school.",
      "Environmental conservation as learners harvest and store rainwater in the school environment.",
      "Learners relate water harvesting and storage to conservation of the community environment learnt in social studies.",
      "Ability to discuss",
      "Discusses measures of",
      "Discusses measures",
      "foods, saving money, readily accessible.",
      "Core competencies: Critical thinking and problem solving: evaluation and decision skills as the learners establish a kitchen or a"
    ],
    "source_file": "Agriculture_And_Nutrion_Grade_8.pdf"
  },
  "Agriculture_And_Nutrition_Grade_4.pdf": {
    "subject": "Agriculture And Nutrition",
    "grade": 4,
    "strand": "1.0 Conservation",
    "substrand": "",
    "learning_outcomes": [
      "Identify two types of",
      "Identify one type of"
    ],
    "key_inquiry_questions": [
      "our resources?",
      "process?",
      "production?",
      "methods?",
      "environment?",
      "hygiene?",
      "making items?"
    ],
    "core_competencies": [
      "Critical thinking and problem solving: evaluation and decision making skills as learners explore ways of reducing wastage in",
      " Learners develop creativity skills as",
      "Creativity and imagination: observation and experimentation skills as learners create scare crow to scare wild animals.",
      " Learners develop learning to learn as they",
      "Learning to learn: own reflection as learners establish tiny seeds in a prepared seedbed.",
      "Self-efficacy: self-confidence as learners make presentations on uses of domestic animals.",
      "Communication and collaboration: team work as learners contribute in the discussion on importance of a balanced diet.",
      " Learners to develop learning to learn by",
      "Learning to learn: organizing own learning as learners apply laid down procedure in boiling and shallow frying foods.",
      "Self-efficacy: practice of good grooming as learners apply skills learnt on personal hygiene.",
      " Learners develop creativity in the use of",
      "Creativity and imagination: thoughtful choices as learners use improvised and locally available cleaning resources.",
      " Learners develop digital literacy as they search",
      "Digital literacy: use of digital technology as learners search for information on personal protective equipment.",
      " Learners apply creativity and",
      "Creativity and imagination: experimentation skills as learners observe, innovate and try out on tacking stitches."
    ],
    "values": [
      "show responsibility by practicing",
      "Responsibility: solving problems proactively as learners use fuels conservatively.",
      "demonstrate responsibility in",
      "Responsibility: engaging in assigned roles and duties as learners construct the scare crow to keep off wild animals.",
      "responsibility in",
      "seeds, develop tolerance and respect while",
      "Respect: accommodation of diverse opinions while the learners undertake seed bed preparation tasks.",
      "community",
      "their community and their uses.",
      "confidently make class presentations, respect",
      "Respect: open mindedness as learners listen and accommodate others opinions during presentations on importance of domestic",
      "Learners relate animals reared in their community to knowledge learnt in social studies on social economic activities.",
      "Unity: collaboration with others as learners select foods that comprise balanced diet.",
      "Responsibility: observes safety precautions when boiling and shallow frying foods.",
      "integrity in",
      "integrity (utilizing",
      "honesty and applies",
      "aspects of integrity",
      "displays honesty and",
      "Applies integrity in less"
    ],
    "suggested_learning_experiences": [
      "Learners are guided to:",
      " Discuss to enumerate the types of",
      " Learners develop problem solving",
      "observe safety in use of fuel.",
      "Critical thinking and problem solving: evaluation and decision making skills as learners explore ways of reducing wastage in",
      "Responsibility: solving problems proactively as learners use fuels conservatively.",
      "Safety of self and others as learners use fuels and related fires.",
      "Learners relate the skills in conservation of fuels to types and sources of energy learnt in science and technology.",
      " Discuss, construct a scarecrow",
      " Learners develop creativity skills as",
      "Creativity and imagination: observation and experimentation skills as learners create scare crow to scare wild animals.",
      "Responsibility: engaging in assigned roles and duties as learners construct the scare crow to keep off wild animals.",
      "Conservation of biodiversity as learners construct scarecrow to keep off wild animals without killing them.",
      "Learners relate conservation of wild animals as part of natural resources learnt in social studies.",
      " Discuss to enumerate food crops such as"
    ],
    "source_file": "Agriculture_And_Nutrition_Grade_4.pdf"
  },
  "Agriculture_And_Nutrition_Grade_5.pdf": {
    "subject": "Agriculture And Nutrition",
    "grade": 5,
    "strand": "2.0 FOOD PRODUCTION PROCESSES",
    "substrand": "",
    "learning_outcomes": [
      "Describe two to three",
      "Describe less than two"
    ],
    "key_inquiry_questions": [
      "of property?",
      "production?",
      "security?",
      "methods?",
      "hygiene?",
      "materials?",
      "garments?"
    ],
    "core_competencies": [
      " Learners develop critical thinking skills to",
      "Critical thinking and problem solving: evaluation and decision making skill as learners explore ways of solving destruction of",
      " Learners develop self-efficacy in producing their",
      "Self-efficacy: self-drive as learners undertake projects to grow vegetable crops.",
      "Communication and collaboration: speaking clearly and effectively as learners make presentations on uses of domestic",
      "Learners develop critical thinking skills to solve the",
      "Critical thinking and problem solving: exploring ways of preserving and storing cereals and pulses to prevent spoilage.",
      " Learners develop digital literacy as they search",
      "Digital literacy: interaction with digital technologies while searching for information on food nutrients.",
      " Learners develop learning to learn while",
      "Learning to learn: self-discipline as learners work cautiously to fry foods.",
      "Self-efficacy: identification of self as learners develop good grooming habits.",
      "Communication and collaboration: listening and speaking skills using facts to support opinions in brainstorming on home",
      " Learners develop learning to learn as they",
      "Critical thinking and problem solving: evaluation and decision making skills as learners explore ways of repairing garment.",
      " Creativity and innovation skills as learners",
      "Creativity and imagination: designing and assembling skills as learners innovate vertical and horizontal gardens."
    ],
    "values": [
      "Integrity: taking personal responsibility in the use of digital devices while searching for information on water conservation.",
      "demonstrating value of patriotism (love) for",
      "Patriotism: learners show love for the environment by conserving animal diversity.",
      "Conservation of biodiversity as learners appreciate cultural heritage in their community.",
      "responsibility in",
      "Learners relate growing of vegetables to social economic activities in the community learnt through social studies.",
      "present the uses of domestic animals, patriotism",
      "Patriotism: appreciating own culture by recognizing diversity of domestic animals reared in the country.",
      "problem of food spoilage, the value of unity and",
      "Unity: taking turns while undertaking tasks in preservation of cereals and pulses.",
      "Learners relate skills in preservation of cereals and pulses to farming activities in the community learnt in social studies.",
      "for information on nutrients, value of unity as",
      "Unity: respect of each other’s opinions while making presentations on importance of nutrients in the body.",
      "Responsibility: observing safety as learners handle hot fats and equipment in frying foods.",
      "integrity in",
      "indicators of integrity in the",
      "of integrity",
      "integrity (commitment to",
      "indicators of integrity",
      "promoting good grooming, respect (open"
    ],
    "suggested_learning_experiences": [
      "Practices 3.3 Laundering",
      "Leaning to learn: learning independently as learners engage in self-driven tasks for water conservation.",
      "Environmental awareness as the learners conserve soil moisture through gardening practices.",
      "Learners relate water conservation to knowledge on natural resources in the environment learnt in social studies.",
      "Learners are guided to:",
      " Watch video clips or listen to a resource",
      " Learners develop critical thinking skills to",
      "Critical thinking and problem solving: evaluation and decision making skill as learners explore ways of solving destruction of",
      "Patriotism: learners show love for the environment by conserving animal diversity.",
      "Conservation of biodiversity as learners appreciate cultural heritage in their community.",
      "Learners relate conservation of wild animals to conservation of natural resources learnt in social studies.",
      " Learners develop self-efficacy in producing their",
      " Learners develop communication skills as they",
      "Communication and collaboration: speaking clearly and effectively as learners make presentations on uses of domestic",
      "Food and nutrition security as the learners appreciate the direct and indirect uses of domestic animals in food production."
    ],
    "source_file": "Agriculture_And_Nutrition_Grade_5.pdf"
  },
  "Agriculture_And_Nutrition_Grade_6.pdf": {
    "subject": "Agriculture And Nutrition",
    "grade": 6,
    "strand": "1.0 Conservation",
    "substrand": "",
    "learning_outcomes": [
      "Use (single or double crochet stitches) to make articles"
    ],
    "key_inquiry_questions": [
      "moisture?",
      "animals?",
      "production?",
      "security?",
      "methods?",
      "hygiene?",
      "problems?",
      "grow crops?",
      "How can we cook foods using stewing methods?"
    ],
    "core_competencies": [
      "Critical thinking and problem solving: open mindedness and creativity as learners look for possibilities for conserving soil",
      " Learners develop creativity skills in",
      "Creativity and imagination: exploration skills as learners seek new ideas to establish physical deterrents against wild animals",
      "Self-efficacy: self-realization and confidence as learners rear small domestic animals such as rabbits for food production.",
      "Critical thinking and problem solving: evaluation and decision making skills as learners explore ways of preserving fruits and",
      " Learners develop learning to learn while",
      "Learning to learn: reflection of own learning to apply stewing and baking of foods.",
      "Self-efficacy: self-confidence skills while learners maintain personal cleanliness as a health habit.",
      " Learners to develop learning to learn as",
      "Learning to learn: researching skills as learners identify and use different ways of removing stains.",
      "Learners develop creativity skills as they construct items",
      "Creativity and imagination: originality skills as learners develop crocheted PPE.",
      "Communication and collaboration: team work as learners share information on moist bed garden."
    ],
    "values": [
      "Patriotism: consciousness of social and moral duties to conserve wild animals and promote biodiversity.",
      "patriotism in",
      "indicators of patriotism",
      "community, obey group",
      "responsibility) in",
      "patriotism (effort to",
      "community, obey",
      "of own responsibility)",
      "animals, integrity in fair allocation of",
      "Integrity: fairness in allocation of resources and tasks in the project for rearing small domestic animals.",
      "integrity by observing hygienic and safe methods",
      "Integrity: choosing to do the right thing and being honest by observing ethical, hygienic and safe methods of preserving fruits",
      "Integrity: prudent use of resources and application of laid down procedure in stewing and baking foods.",
      "of patriotism (effort to",
      "stains, responsibility as they take care of",
      "Responsibility: proactive engagement skills by removing stains to maintain cleanliness.",
      "responsibility in",
      "aspects of responsibility",
      "problems and respecting",
      "responsibility (care"
    ],
    "suggested_learning_experiences": [
      "Learners are guided to:",
      " Learners develop problem solving skills as they",
      "Critical thinking and problem solving: open mindedness and creativity as learners look for possibilities for conserving soil",
      "Social justice: fairness and justice as learners share tasks and responsibilities in preparation of seedbeds.",
      "Conservation of resources as learners conserve water through preparation of water conserving seedbeds.",
      "Learners relate conservation of soil moisture to farming activities learnt in social studies.",
      " Discuss with a resource person on the",
      " Learners develop creativity skills in",
      "Creativity and imagination: exploration skills as learners seek new ideas to establish physical deterrents against wild animals",
      "Learners relate conservation of wild animals through use of deterrents to knowledge on importance of wildlife learnt in social",
      "the learner should be able",
      " Learners develop self-realization and",
      "Self-efficacy: self-realization and confidence as learners rear small domestic animals such as rabbits for food production.",
      "Learners relate rearing of small domestic animals to knowledge of farming as a socio-economic activity learnt in social",
      " Watch video clips or listen to resource person"
    ],
    "source_file": "Agriculture_And_Nutrition_Grade_6.pdf"
  },
  "Agriculture_And_Nutrition_Grade_9.pdf": {
    "subject": "Agriculture And Nutrition",
    "grade": 9,
    "strand": "2.0 FOOD PRODUCTION PROCESSES",
    "substrand": "",
    "learning_outcomes": [],
    "key_inquiry_questions": [
      "food wastage?",
      "resources?",
      "gardening?",
      "produce?",
      "storage?",
      "mixture?",
      "hygiene?",
      "purposes?",
      "How can we produce food crops through organic gardening?",
      "How should crop produce be managed during storage?"
    ],
    "core_competencies": [
      " creativity and imagination skills on preparing",
      "Creativity and imagination: experimenting skills as learners explore different ways of preparing left over foods.",
      " creativity skills in the designing and making a",
      " Creativity and imagination: observation and making connection skills as learners seek information, design and make a",
      " Critical thinking and problem solving: evaluation and decision-making skills as learners analyse the environment for",
      " learning to learn as learners make self-discovery of",
      " Learning to learn: working collaboratively and organising own learning skills as learners grow crops using organic",
      " Self-efficacy: planning skills as learners grow crops using organic farming practices.",
      " critical thinking skills (open mindedness) as",
      "Critical thinking and problem solving: open-mindedness and creativity skills as learners prepare storage structure and manage",
      " learning to learn as learners apply procedures",
      "Learning to learn: reflection on own work as learners apply procedures of preparing flour mixtures.",
      "creativity and innovative",
      "Critical thinking and problem solving: reflection skills as learners assess their success in cleaning of waste disposal facilities.",
      " learning to learn as learners acquire new skills",
      "Learning to learn: organizing own learning as they acquire new skills on methods of disinfecting clothing and household articles.",
      " learning to learn as learners realize new field",
      " Learning to learn: skill on reflection on own work as learners evaluate success on the grafted plant for rejuvenation,",
      " Self-efficacy: awareness of potential skills in manipulation of a plant through grafting for plant propagation.",
      " Self-efficacy: leadership and planning skills as learners design, construct and use homemade sun dryer for vegetables."
    ],
    "values": [
      "leftover foods, value of integrity to avoid",
      "Integrity: utilizing resources prudently to avoid wastage of resources in the preparation of leftover foods.",
      "model of integrated farming, respect for each",
      " Unity: team work as learners harness gifts and special skills of the group members in designing and making an integrated",
      " Respect: accommodating diverse opinions while learners discuss and design model of integrated farming.",
      "responsibility in",
      "responsibility (offers",
      "applicable gardening techniques, integrity as",
      "learners honestly declare organic practices, unity",
      " Unity: working in teams as learners undertake the project on growing crops using organic gardening practices.",
      " Integrity: honesty as learners practice organic gardening practices.",
      "d) show responsibility",
      "spoilage, responsibility as learners team play to",
      "Responsibility: engaging in assigned roles as learners manage stored crop produce in the school food store.",
      "of making flour mixtures, integrity as learners",
      "Integrity: following ethically acceptable procedures in preparing flour mixtures.",
      "unity while carrying",
      "three indicators of unity",
      "indicators of unity",
      "unity (sharing of"
    ],
    "suggested_learning_experiences": [
      "to extend knowledge and create awareness to the school community. 26 vegetables.",
      "Practices  Written test  Oral assessment on safety when handling animal.  Observation of learning  Oral tests  Project  Activity journals",
      "Learners to use existing school forums to sensitize the school community on hygiene practices. 4.0 Production",
      "Learners to use existing school forums to create awareness and enhance adoption of various production techniques.",
      "Learners are guided to:",
      "Creativity and imagination: experimenting skills as learners explore different ways of preparing left over foods.",
      "Learners relate conservation of leftover foods to spread of food related communicable diseases learnt through Integrated science.",
      " learners make class presentations on the models of",
      " Creativity and imagination: observation and making connection skills as learners seek information, design and make a",
      " Critical thinking and problem solving: evaluation and decision-making skills as learners analyse the environment for",
      " Unity: team work as learners harness gifts and special skills of the group members in designing and making an integrated",
      " Respect: accommodating diverse opinions while learners discuss and design model of integrated farming.",
      "Environmental awareness and protection as learners re-use locally available resources such as waste pieces of wood, cartons,",
      "Learners apply skills of designing and choice of materials learnt in Pre-Technical Studies in the construction of integrated",
      "leadership, observes safety,"
    ],
    "source_file": "Agriculture_And_Nutrition_Grade_9.pdf"
  },
  "CRE_Grade_7.pdf": {
    "subject": "Cre",
    "grade": 7,
    "strand": "2.0: CREATION",
    "substrand": "",
    "learning_outcomes": [
      "Use a digital device"
    ],
    "key_inquiry_questions": [
      "account?",
      "accounts?",
      "and birds?",
      "animals?",
      "take care of plants?",
      "environment?",
      "resources?",
      "Christian?",
      "the Bible?",
      "different languages?",
      "our society today?”?",
      "Israel important?",
      "fulfilled?",
      "the Messiah?",
      "of Jesus Christ?"
    ],
    "core_competencies": [
      "● Communication and collaboration: the learners discuss in pairs the similarities and differences between the two biblical",
      "● Creativity and imagination: the learners compose a song on the second creation account",
      "● Digital literacy: the learners in groups, use the internet to search for the attributes of God",
      "● Learning to learn: the learners take a nature walk and observe different features in the environment",
      "● Critical thinking and problem solving: the learners discuss ways they protect animals, fish and birds.",
      "● Learning to learn: the learners write sensitisation messages on charts/posters on the importance of good stewardship",
      "● Creativity and Imagination: learners compose a poem on how they take care of animals, fish and birds",
      "● Communication and collaboration: learners brainstorm on how they take care of animals, fish and birds",
      "● Learning to learn: the learners interact with a resource person on responsible ways of using plants",
      "● Communication and collaboration: the learners in groups list activities they do to care for plants in their environment",
      "● Self-efficacy: learner’s interact with a resource person (environmentalist/ forest officer/any other relevant person) and",
      "● Critical thinking and problem solving: learners plant an income generating crop either at home or school",
      "● Learning to learn: learners brainstorm on how human beings use and misuse God’s creation",
      "● Critical thinking: learners discuss the effects of misusing of natural resources",
      "● Digital literacy: learners use online resources to search on ways in which human beings use and misuse natural resources",
      "● Creativity and imagination: learners compose songs on the beauty of God’s creation",
      "● Creativity and imagination: learners compose a song about the Bible",
      "● Critical thinking : learners prepare a presentation on how God’s word inspire different services among Christians",
      "● Learning to learn: learners discuss how the Bible promotes spiritual, moral, social, emotional, and intellectual growth of a",
      "● Digital Literacy: learners prepare a PowerPoint on the importance of the Bible in the society today"
    ],
    "values": [
      "● Responsibility: the learners take care of God’s creation in their environment",
      "● Responsibility: the learners take care of the different animals, fish and birds",
      "● Patriotism: learners show love for their country as they visit a zoo, animal park or farm and observe how animals, fish and",
      "Responsibility",
      "● Responsibility: the learners plant an income generating crop either at home or school",
      "● Unity: the learners take turns to read Genesis 1:29: Genesis 2:15 and Psalm 104:14 and summarize the biblical teachings on",
      "● Responsibility: learners engage in cleaning the school, as a way of conserving the environment",
      "● Respect: learners take turns to air their views and respect each other’s opinions",
      "local community and write a journal",
      "● Unity: learners work in groups and prepare PowerPoint slides or charts on the importance of the Bible",
      "● Respect: learners read in turns various Bible texts",
      "● Responsibility: learners engage in different services in their local community.",
      "● Effective communication: learners use the Bible to share the Word of God, discuss in groups, and serve in the community",
      "● Unity: learners work in groups to sort and arrange in order books of the Bible using the flash cards",
      "● Responsibility: learners in pairs design a bookmark on the books of the Bible and place it in their books/Bible",
      "● Unity: learners work in groups and pairs to discuss, brainstorm and appreciate the importance of Bible translation",
      "● Respect: learners take turns and listen as each of them air their views/ideas as they engage in different assignments",
      "of integrity for the good",
      "and the community",
      "● Imagination and creativity: the learners write a journal on how to be a good leader in the school, church, and the community"
    ],
    "suggested_learning_experiences": [
      "● English: the learners debate and discuss in groups",
      "● Pre-technical Studies: the learners use digital devices to search for information",
      "b) discuss the similarities",
      "The learner is guided to:",
      "● read in turns Genesis 1:1-50 & 2:1-2:4a on",
      "● in pairs discuss the similarities and",
      "accounts of creation and write short notes",
      "search for the attributes of God, and write",
      "● Communication and collaboration: the learners discuss in pairs the similarities and differences between the two biblical",
      "● Creativity and imagination: the learners compose a song on the second creation account",
      "● Digital literacy: the learners in groups, use the internet to search for the attributes of God",
      "● Learning to learn: the learners take a nature walk and observe different features in the environment",
      "● Responsibility: the learners take care of God’s creation in their environment",
      "● Gender mainstreaming: the learners recognize that God created human beings as male and female who complement each",
      "● Environmental issues in education: the learners take a nature walk and explore features in their environment"
    ],
    "source_file": "CRE_Grade_7.pdf"
  },
  "CRE_Grade_8.pdf": {
    "subject": "Cre",
    "grade": 8,
    "strand": "1.0 CREATION",
    "substrand": "Specific Learning Outcomes",
    "learning_outcomes": [],
    "key_inquiry_questions": [
      "Christians today?",
      "God’s promises?",
      "to Christians today?",
      "leadership?",
      "day-to-day life?",
      "love for the lost?",
      "the Holy Spirit?",
      "the needy?",
      "each other?",
      "life sacred?",
      "and abilities?",
      "How do you use your God-given talents, gifts and abilities?"
    ],
    "core_competencies": [
      " Communication and Collaboration: the skill of teamwork and communicating effectively is enhanced as learners share in",
      " Learning to learn: the skill of working collaboratively is exhibited as learners brainstorm on moral values and life skills",
      " Digital literacy: the skill of using digital platforms is exhibited as learners write sensitisation/awareness messages using a",
      " Learning to learn: the skill of shared knowledge is portrayed as learners brainstorm how God demonstrated his love after the",
      " Learning to learn: the skill of working collaboratively is portrayed as learners brainstorm and work in groups.",
      " Communication and collaboration: the skill of writing is demonstrated as learners develop a weekly journal on how they",
      " Digital Literacy: the skill of using digital technology is enhanced as learners make PowerPoint presentations/watch a video",
      " Critical thinking and problem-solving: the skill of creating solutions to complex problems is portrayed as learners buzz on",
      " Self-efficacy: personal skills are demonstrated as learners obey God’s law.",
      " Digital literacy: the skill of using digital devices is portrayed as learners conduct an internet search on reasons against",
      " Citizenship Education-Integrity: learners apply lessons learnt from King Saul’s failures and do God’s will/ follow His",
      " Communication and collaboration: the skills of listening, speaking and teamwork are enhanced as learners brainstorm and",
      " Self-efficacy: the skill of task execution is portrayed as learners compose a prayer on healing and recite it in class.",
      " Creativity and imagination: the skill of making connections is enhanced as learners role-play a challenging situation affecting",
      " Self-efficacy: the skill of self-awareness is demonstrated as learners discuss instances they have faced challenging situations",
      " Digital literacy: the skill of using digital learning platforms is enhanced as learners watch a movie on the healing of the",
      " Self-efficacy: the skill of self-awareness is portrayed as learners write a personal reflection journal on occasions when God",
      " Communication and collaboration: the skills of speaking, listening and teamwork are portrayed as learners’ brainstorm on",
      " Self-Efficacy: the skill of task execution is exhibited as learners share personal experiences on how they pray to God in day-",
      " Citizenship: active community skills are demonstrated as learners organise a class visit to the less fortunate, give them"
    ],
    "values": [
      " Responsibility: learners decide to avoid sin/temptations/tempting places.",
      " Respect: learners accommodate each other’s views and take turns in reading the Bible/sharing personal experiences.",
      "in the community",
      " Unity: learners perform different activities/assignments in groups.",
      " Unity: learners work collaboratively in groups and accommodate each other’s views.",
      " Responsibility: learners read Hebrews11:1-6 and make notes in their exercise books or use a digital device.",
      " Respect: learners respect each other’s views as they take turns to read, discuss and share experiences.",
      " Responsibility: learners undertake and complete their assignments on time.",
      "the community.",
      "school and in the community.",
      " Citizenship Education-Integrity: learners apply lessons learnt from King Saul’s failures and do God’s will/ follow His",
      " Integrity: learners follow God’s instructions by being patient/exercising self-control and doing the right thing even when no",
      " Responsibility: learners write a journal on how they exercise leadership at home, school and in the community.",
      " Responsibility: learners write a prayer on healing and recite it in class.",
      " Responsibility: learners write a personal journal on how they depend on God in day-to-day life.",
      " Unity: learners work together to complete different tasks/assignments.",
      " Respect: learners take turns as they discuss and brainstorm on various learning activities.",
      " Unity: learners work in groups as they discuss, read various Bible texts and watch a movie on the healing of the paralytic.",
      " Respect: learners demonstrate respect for one another as they take turns to talk and accommodate each other’s views.",
      " Responsibility: learners take responsibility for their daily tasks/assignments/ pray daily."
    ],
    "suggested_learning_experiences": [
      "d) discuss moral values",
      "The learner is guided to:",
      " search / read about the sins young",
      " read Genesis 3:1-13 and write short",
      " read Genesis 3: 14-19, 23, 4:6-12,",
      " discuss the causes of sin among",
      "temptations/sin; write the moral",
      " write 1 John 1:9 on flashcards and",
      " Communication and Collaboration: the skill of teamwork and communicating effectively is enhanced as learners share in",
      " Learning to learn: the skill of working collaboratively is exhibited as learners brainstorm on moral values and life skills",
      " Decision-making: learners in pairs buzz on how to overcome sins/ temptations/tempting situations",
      " Spiritual development: learners make a prayer to God every day for grace to overcome temptations/write 1 John 1:9 on",
      " Responsibility: learners decide to avoid sin/temptations/tempting places.",
      " Respect: learners accommodate each other’s views and take turns in reading the Bible/sharing personal experiences.",
      " English: learners read, debate, brainstorm and communicate effectively as they share personal experiences."
    ],
    "source_file": "CRE_Grade_8.pdf"
  },
  "CRE_Grade_9.pdf": {
    "subject": "Cre",
    "grade": 9,
    "strand": "2.0: THE BIBLE",
    "substrand": "Specific Learning",
    "learning_outcomes": [
      "Learning Experiences"
    ],
    "key_inquiry_questions": [
      "upright life?",
      "woman Judge?",
      "challenges?",
      "Christians?",
      "gratitude to God?",
      "his life?",
      "important?",
      "leaders?",
      "your life?",
      "marriage?",
      "achieved?",
      "idleness?",
      "for money?",
      "community need?",
      "on a project?"
    ],
    "core_competencies": [
      " Learning to learn: the skill of sharing learnt knowledge is exhibited as learners brainstorm on moral values that youth",
      " Critical thinking and problem-solving: the skill of evaluation and decision-making is demonstrated as learners perform a",
      "● Learning to learn: the skill of sharing learnt knowledge is exhibited as learners brainstorm on lessons learnt from the",
      " Critical Thinking and problem-solving: the skill of evaluation and decision-making is demonstrated as learners discuss",
      " Learning to learn: the skill of sharing learnt knowledge is exhibited as learners conduct a discussion and make notes on",
      " Critical thinking and problem-solving: the skill of evaluation and decision-making is demonstrated as learners role-play",
      "● Communication and Collaboration: the skill of collegially working as a team is demonstrated as learners clearly express",
      "● Digital Literacy: the skill of managing online activities for the benefit of self and others is portrayed as learners use digital",
      "● Critical thinking and problem-solving: the skill of interpretation and inference is exhibited as learners discuss how Jesus",
      "● Learning to learn: the skill of working collaboratively is enhanced as learners share experiences on challenges they have",
      "● Learning to learn: the skill of sharing learnt knowledge is portrayed as learners share experiences on how they express",
      "● Communication and Collaboration: the skill of teamwork is portrayed as learners discuss, role-play and recognise the",
      "● Imagination and Creativity: the skill of networking is enhanced as learners undertake group activities that inspire creative",
      "● Digital Literacy: the skill of using digital platforms is portrayed as learners make a presentation using a digital device.",
      "● Citizenship: by Jesus healing the frustrated and separated lepers, He enabled them to rejoin other members of the society",
      " Communication and collaboration: the skill of collegially working as a team and expressing opinions, argument and",
      " Learning to learn: the skill of sharing learnt knowledge is enhanced as learners brainstorm the meaning of the word",
      " Communication and Collaboration: the skill of teamwork is enhanced as learners contribute in group discussions by",
      " Imagination and Creativity: the skill of making connections is demonstrated as learners take on different roles to complete",
      " Learning to learn: the skill of reflection on own work is demonstrated as learners write a reflection journal on how they"
    ],
    "values": [
      "integrity, respect for self, self-",
      " Respect: learners respect themselves and others by avoiding vices that can defile them.",
      " Integrity: learners decide to do the right thing by avoiding sexual perversity.",
      " Civic responsibility: Judge Deborah gave advice and accompanied Barak in the war against the Canaanites.",
      " Respect: learners accommodate each other’s views as they discuss and brainstorm in groups",
      " Patriotism: learners list women leaders in the church, school and the government, and qualities they can emulate from",
      "integrity at school,",
      "community.",
      "community and make a presentation using",
      " Respect: learners accommodate each other’s views as they discuss and brainstorm in groups.",
      " Patriotism: learners conduct a buzz session on characteristics of a good leader and execute the task by following laid down",
      "leaders of integrity at",
      "the community.",
      "community and",
      "community with",
      "and respect each other’s opinions, and defend their arguments/views confidently.",
      "● Patriotism: the 10 lepers were integrated back to the society after they were healed; according to the Law of Moses, a",
      "● Unity: learners communicate and collaborate in doing various activities.",
      " Unity: learners take turns in conversations and activities and respect the opinions of others.",
      " Responsibility: learners engage in assigned roles, tasks and duties and complete them on time."
    ],
    "suggested_learning_experiences": [
      "By the end of the sub-strand, the learner should be able to: a) elaborate Christian moral values that a young person should uphold in day-to-day life, b) describe forbidden sexual practices outlined in the Bible, c) utilise Christian moral",
      "the learner should be able to:",
      "The learner is guided:",
      "20, Leviticus 11:44, and discuss the",
      "● in groups read Galatians 5:19 and",
      "● in pairs discuss how to avoid getting",
      "● read Romans 1:26-27 and brainstorm on",
      " Learning to learn: the skill of sharing learnt knowledge is exhibited as learners brainstorm on moral values that youth",
      " Critical thinking and problem-solving: the skill of evaluation and decision-making is demonstrated as learners perform a",
      " Human Sexuality: Sexual morality-Abstinence: learners outline moral values that Christian youths should uphold to avoid",
      " Assertiveness: learners utilize moral values and life skills that enable them to overcome growth and developmental",
      " Counselling Services: learners are guided on self-awareness, decision-making and positive behaviour change.",
      " Parental Empowerment and Engagement: parents/guardians model good behaviour and guide learners through their",
      " Peer Education and Mentorship: learners are mentored on overcoming life and academic challenges.",
      " Respect: learners respect themselves and others by avoiding vices that can defile them."
    ],
    "source_file": "CRE_Grade_9.pdf"
  },
  "Creative_Arts_And_Sports_Grade_8.pdf": {
    "subject": "Creative Arts And Sports",
    "grade": 8,
    "strand": "1.0 Foundations",
    "substrand": "",
    "learning_outcomes": [],
    "key_inquiry_questions": [
      "and Sports?",
      "in music?",
      "photomontage?",
      "interesting?",
      "day life?",
      "game of Netball?",
      "in a Netball game?",
      "instruments?",
      "of music?",
      "figure drawings?",
      "an audience?",
      "performance?",
      "survival skills?",
      "Kenyan culture?",
      "What is the role of music in day to day life?"
    ],
    "core_competencies": [
      "● Self-Efficacy: the learner gains new knowledge on elements of Creative Arts and Sports, confidence building the",
      "● Digital Literacy: the learner uses digital tools for graphic design or virtual art platforms, they hone their digital skills by",
      "● Communication and Collaboration: The learner hones their teamwork skills, during group fitness activities, fostering a",
      "● Learning to Learn: the learner hones the research and adaptation skills, while seeking information on various fitness",
      "● Digital Literacy: the learners enhance proficiency in utilising digital resources for musical exploration while using",
      "● Communication and Collaboration: as the learner Participates in group art projects, they hone their learner's ability to",
      "citizenship, patriotism,",
      "● Creativity and imagination: achieved when the learner formulates rhythmic patterns in 3-4 time to accompany warm-",
      "● Critical thinking and problem solving: developed as the learner creates, represents and interprets rhythm using",
      "● Communication and collaboration: the learner works collaboratively, listening to each other and speaking articulately",
      "● Critical Thinking: the learner fosters critical thinking skills while critiquing others’ photomontages.",
      "● Learning to Learn: the learner embraces the challenge of creating photomontage, observe learners and demonstrate",
      "● Creativity and Imagination: the learner creates and presents an artistic photomontage composition of athletes running.",
      "● Digital Literacy: the learner employs digital tools to observe photomontage and athletes running.",
      "● Global Citizenship: the learner appreciates local and international athletes in the process of making photomontage.",
      " Self-Efficacy: the learner gains confidence by composing and notating four-bar melodies in",
      " Learning to Learn: the learner, through composing four-bar melodies 3-4 time, demonstrates a capacity to learn and",
      " Digital Literacy: the learner employs digital tools and software for composing, notating, and recording melodies.",
      " Communication and Collaboration: the learner engages in effective communication to express their musical ideas",
      " Citizenship Education: demonstrated as the learner makes reference to songs and pieces of music from local and"
    ],
    "values": [
      "● Unity: the learner Collaborates with peers during group fitness sessions, fostering a sense of unity and mutual support",
      "● Respect: the learner respects the diverse musical influences within a group, acknowledging and valuing the individual",
      "● Patriotism: the learner describes elements of local folk dances with a sense of cultural pride, contributing to a patriotic",
      "citizenship, patriotism,",
      "● Responsibility: the learner develops skills of self-drive and accountability while creating and performing rhythms in 3 4",
      "● Unity: the learner works in harmony with others while creating and performing rhythms on monotone.",
      "● Integrity: the learner is equipped with the value of honesty as they interact with already created rhythmic patterns and",
      "● Responsibility: the learner takes responsibility for ensuring a clean environment around the working areas as they create",
      "● Respect: the learner acknowledges the diverse backgrounds and abilities of each other, demonstrating respect for",
      "● Patriotism: the learner shows patriotism by sharing experiences of running middle distance races and representing the",
      " Integrity: the learner upholds integrity by creating original melodies, respecting others’ intellectual property, and",
      " Respect: the learner gives feedback using respectful language, and valuing diverse perspectives and contributions made",
      " Unity: the learner values the contributions of each team member, recognizing that unity enhances overall team",
      " Integrity: the learner exhibits integrity by following the rules and ethical guidelines of the game as they play in teams for",
      "integrity.",
      " Respect: the learner objectively critiquing each other's drawings of human figures.",
      " Responsibility: by the learner ensuring working areas are clean after drawing the human figures.",
      " Responsibility: the learner develops skills of self-drive, accountability and determination while decorating fabric, creating",
      " Integrity: the learner is equipped with the value of honesty through the creation of own original works devoid of plagiarism.",
      " Unity: the learner develops works in pairs and groups when decorating fabric and producing a play."
    ],
    "suggested_learning_experiences": [
      " English: the learner enhances English language proficiency by articulating the roles of Creative Arts and Sports in",
      " Social Studies: the learner gets insights into the cultural, historical, and societal roles of Creative Arts and Sports,",
      "The learner is guided to:",
      "discuss basic elements of play;",
      "● Self-Efficacy: the learner gains new knowledge on elements of Creative Arts and Sports, confidence building the",
      "● Digital Literacy: the learner uses digital tools for graphic design or virtual art platforms, they hone their digital skills by",
      "● Communication and Collaboration: The learner hones their teamwork skills, during group fitness activities, fostering a",
      "● Learning to Learn: the learner hones the research and adaptation skills, while seeking information on various fitness",
      "● Digital Literacy: the learners enhance proficiency in utilising digital resources for musical exploration while using",
      "● Communication and Collaboration: as the learner Participates in group art projects, they hone their learner's ability to",
      "● Love: the learner expresses genuine enjoyment and affection for fitness activities, demonstrating a love for maintaining a",
      "● Unity: the learner Collaborates with peers during group fitness sessions, fostering a sense of unity and mutual support",
      "● Respect: the learner respects the diverse musical influences within a group, acknowledging and valuing the individual",
      "● Patriotism: the learner describes elements of local folk dances with a sense of cultural pride, contributing to a patriotic",
      "● Identifying and nurturing gifts and talents: the learner identifies different categories of Creative Arts and Sports to"
    ],
    "source_file": "Creative_Arts_And_Sports_Grade_8.pdf"
  },
  "Creative_Arts_Grade_4.pdf": {
    "subject": "Creative Arts",
    "grade": 4,
    "strand": "2.0 PERFORMANCE AND DISPLAY",
    "substrand": "",
    "learning_outcomes": [],
    "key_inquiry_questions": [
      "Netball?",
      "painting?",
      "created?",
      "daily life?",
      "melodies?",
      "sprinting?",
      "athletic event?",
      "gymnastics?",
      "recorder?",
      "life skill?",
      "photography?",
      "folk songs?",
      "Why is colour classification important in painting?",
      "How are rhythms applied in daily life?",
      "Why is the Kenya National Anthem performed during an athletic event?"
    ],
    "core_competencies": [
      "● Communication and Collaboration: Learner speaks clearly and listens keenly while critiquing peers’ works and work",
      "● Digital literacy: Learner interacts with digital devices to source information on percussion instruments.",
      "● Creativity and Imagination: Learner explores with varied materials to use when improvising balls.",
      "● Communication and Collaboration: The learner listens and speaks clearly to each other when demonstrating the skills of",
      "● Communication and Collaboration: Learner works with others in groups and speaks clearly during critique of their own",
      "● Creativity and Imagination: Learner applies the techniques of composition and comes up with unique rhythmic patterns.",
      "● Creativity and Imagination: Developed as the learner uses unique and new ideas to compose melodies and while using",
      "● Self -efficacy - Learner develops self-efficacy through free hand lettering, modelling and composing melodies.",
      "● Citizenship: the learner understands collective responsibility while singing the Kenya National Anthem and as they",
      "● Digital literacy: Learner uses digital technology to search for information on the Kenyan flag from online sources.",
      "● Citizenship: Learner gets to engage with others as they sing Kenyan patriotic songs.",
      "● Creativity and imagination: learner creates unique rhythmic movements while performing the side roll and crab balance",
      "● Critical thinking and problem solving: the learner follows simple instructions and seeks help when need be to select",
      "● Digital literacy: - Learner uses digital devices to search and watch how to play notes on the descant recorder using",
      "● Learning to learn: Learner searches for and acquires skills of how to play new notes on the descant recorder.",
      "● Critical thinking and problem solving: developed as learner searchers for appropriate materials to use for making a",
      "● Creativity and Imagination: Learner makes thoughtful choices that support creativity when they select appropriate",
      "● Citizenship: Learner performs folk songs drawn from different Kenyan communities developing and appreciating",
      "● Critical thinking and problem solving: Learner listens to and discusses different aspects of folk songs enhancing critical",
      "● Communication and Collaboration: Learner sings different types of songs expressively using appropriate gestures, facial"
    ],
    "values": [
      "● Responsibility: Learner cares for own and peers’ items and observes safety precautions when making charcoal sticks.",
      "● Responsibility: Learner takes initiative to clean the working area and store the balls in an improvised storage.",
      "● Unity: Learner works together with peers when painting, improvising a ball and performing the Netball skills of",
      "te observing integrity,",
      "respecting each other’s views fairly.",
      "● Respect: Learner accommodates others’ views during critique of their own and others’ original rhythmic compositions.",
      "● Integrity: Inculcated as the learner creates their own original rhythmic patterns.",
      "self and peers and talk in turns respecting each",
      "● Unity: Learner works with peers when writing using free hand, modelling, creating and performing various melodies.",
      "● Love: Will be realised as the learner respects others while critiquing each other's performance.",
      "● Citizenship: the learner understands collective responsibility while singing the Kenya National Anthem and as they",
      "● Integrity: learner adheres to the rules of starting a sprint and sprinting to avoid disqualification during a race",
      "● Patriotism: Learner draws, paints the Kenyan flag and sings the Kenya National Anthem .",
      "● Responsibility: as learners put into practise the aspects of safety of self and others when performing the rolls and",
      "● Respect: is instilled during group discussions as the learner listens to and accommodates peers’ views.",
      "● Responsibility: is developed through taking care of the descant recorder and using digital devices.",
      "● Respect: Learner respect others work and opinions as they show and talk about own and others photographs presented in",
      "● Responsibility: Learner observes own and others safety while performing and practising the crouch and standing surface",
      "community) and classify them as work,",
      "costumes within Kenyan community (tie-dye"
    ],
    "suggested_learning_experiences": [
      "● Responsibility: Learner cares for own and peers’ items and observes safety precautions when making charcoal sticks.",
      "● Safety and security: Learner observes fire safety when burning charcoal sticks.",
      "The learner is guided to:",
      "● observe/participate in a demonstration of the",
      "● Communication and Collaboration: The learner listens and speaks clearly to each other when demonstrating the skills of",
      "b) write the French",
      "● listen to/sing familiar topical songs and is",
      "● use free hand lettering to write French",
      "● listen to rhythmic patterns in familiar tunes",
      "and discuss the techniques used in",
      "● Integrity: Inculcated as the learner creates their own original rhythmic patterns.",
      "● write solfa syllables (d r m) using free hand",
      "● brainstorm on and discuss the qualities of a good",
      "● Creativity and Imagination: Developed as the learner uses unique and new ideas to compose melodies and while using",
      "free hand lettering to write the solfa syllables."
    ],
    "source_file": "Creative_Arts_Grade_4.pdf"
  },
  "Creative_Arts_Grade_5.pdf": {
    "subject": "Creative Arts",
    "grade": 5,
    "strand": "2.0 PERFORMANCE AND DISPLAY",
    "substrand": "",
    "learning_outcomes": [],
    "key_inquiry_questions": [
      "popular?",
      "created?",
      "melodies?",
      "performed?",
      "prepared?",
      "society?",
      "fastest stroke?",
      "folk song?",
      "a dance?",
      "performance?",
      "recorder?",
      "What are the advantages of casting with papier mache?",
      "How can rhythm be used in daily life?",
      "Why is calligraphy lettering used in writing melodies?",
      "How are plaiting materials prepared?"
    ],
    "core_competencies": [
      " Creativity and Imagination: Learner explores techniques of making crayons, etching, and mounting pictures.",
      " Communication and collaboration: Learner speaks clearly and effectively while describing the process of making crayons",
      " Communication and Collaboration: Learner contributes ideas on executing the skill of kicking, shooting, stopping,",
      " Digital literacy: Learner adopts digital technology to study process, materials and tools for tie-dye technique of fabric",
      " Creativity and imagination: Learner comes up with new ideas on how to improvise cones using papier mache",
      " Communication and collaboration: developed as a learner works with a peer to execute a cartwheel and when they speak",
      " Creativity and imagination: developed as the learner utilises the composition techniques to compose original rhythmic",
      " Learning to learn: developed as the learner takes initiative to understand how rhythmic patterns are created .",
      " Self-efficacy: learner develop self-efficacy when creating their own melodies and recording using digital devices.",
      " Digital literacy: developed as the learner connects to digital devices to search and watch videos of hand signs and",
      " Creativity and imagination: Learners explore the solfa syllables and French rhythm names to create their own original",
      " Communication and Collaboration: Learner shares resources and ideas on executing the skill of batting, fielding when",
      " Creativity and imagination: The learner will apply skills of creativity as they work in groups and exchange new ideas to",
      "inspire creativity when carving the bat and perform melodies during warm up.",
      " Digital literacy: The learner uses digital technology to research on the skills of batting and fielding in rounders.",
      " Digital literacy: learner manipulates digital devices to watch a visual baton exchange.",
      " Creativity and imagination: learner comes up with new ideas on how to improvise a baton exchange.",
      " Communication and Collaboration: learner contributes to group decision making by recognizing the value of others'",
      "Creativity and imagination: Learner will explore new materials and ideas when making puppets from found objects.",
      " Digital literacy: learner uses digital devices to take photographs and video clips on own and others performance"
    ],
    "values": [
      "language while respecting other’s views.",
      " Respect - instilled as the learner talks about peers’ work using appropriate words.",
      " Responsibility - inculcated through use of locally available materials sustainably to make crayons.",
      " Respect: developed as the learner appreciates others’ effort as they execute the skills of kicking, shooting and",
      " Responsibility: the learner observes safety precaution while executing skills and playing the mini game",
      " Unity: learners will cooperate to create cones and as they display team spirit as they play together",
      " Integrity: will be inculcated in the learner as they present their originally created rhythmic patterns.",
      " Unity: the value of unity will be promoted as the learner works collaboratively when executing the cartwheel skill.",
      " Respect: is instilled through listening to other’s works and opinions in reviewing created cards and melodies.",
      " Unity: achieved through working in groups to create cards and melodies.",
      " Integrity : the learner will be required to display honesty by coming up with own original melodies and cards without",
      " Respect: Developed as the learner appreciates diverse opinions as they compose chants for warm up",
      "African Community",
      "African Community Anthem",
      "● discuss the East African Community",
      " Responsibility: learner engages in improvising of batons for use during the game.",
      " Unity: learner displays team spirit as they exchange batons during a relay race.",
      " Integrity: Learner applies laid down procedure to make own puppets.",
      " Responsibility: learner engages in recording video clips of own and others' performance and gives feedback.",
      " Unity: is developed while performing folk dances from other communities and relating/ interacting with each other."
    ],
    "suggested_learning_experiences": [
      " Respect - instilled as the learner talks about peers’ work using appropriate words.",
      "The learner is guided to:",
      "● observe and participate in a demonstration of",
      " Respect: developed as the learner appreciates others’ effort as they execute the skills of kicking, shooting and",
      " Responsibility: the learner observes safety precaution while executing skills and playing the mini game",
      " Unity: learners will cooperate to create cones and as they display team spirit as they play together",
      " Resource mobilisation and utilisation- the learner seeks parental assistance when collecting materials for improvisation of",
      "d) write rhythmic patterns",
      "● listen to/sing simple songs and identify",
      "● Write down dictated rhythmic patterns",
      "● sing/listen to different songs and are",
      "● write two- beat rhythmic patterns in",
      " Creativity and imagination: developed as the learner utilises the composition techniques to compose original rhythmic",
      " Learning to learn: developed as the learner takes initiative to understand how rhythmic patterns are created .",
      " Integrity: will be inculcated in the learner as they present their originally created rhythmic patterns."
    ],
    "source_file": "Creative_Arts_Grade_5.pdf"
  },
  "Creative_Arts_Grade_6.pdf": {
    "subject": "Creative Arts",
    "grade": 6,
    "strand": "2.0: PERFORMANCE AND DISPLAY",
    "substrand": "",
    "learning_outcomes": [
      "Create a catalogue of"
    ],
    "key_inquiry_questions": [
      "patterns?",
      "creativity?",
      "environment?",
      "melodies?",
      "performed?",
      "athletics?",
      "recorder?",
      "ensemble?",
      "What are the sources of natural dyes?",
      "Why create rhythm in different beat patterns?",
      "Why is recycling beneficial to the environment?",
      "Why is it important to maintain a tempo in athletics?",
      "Why is overlapping important in a montage work?"
    ],
    "core_competencies": [
      " Critical thinking and problem solving: Learner will be developed as the learner explores multiple perspectives of creating",
      " Digital literacy: Learner use digital technology to source virtual or actual pictures of players executing skills in",
      " Creativity and imagination: The learner will apply creative skills in selecting media for drawing, and rhythms that are",
      " Creativity and Imagination: learner combines various techniques to creatively come up with rhythmic patterns and",
      " Self-efficacy - learners will develop the ability to create and improvise rhythmic patterns",
      "creativity?",
      " Digital literacy: learner adopts digital technology to record videos of own and peers’ execution of gymnastics",
      " Critical thinking and problem solving : will be developed as the learner practises and creates different 3-phase sequences",
      " Creativity and imagination: learner comes up with new ideas on how to make a frame loom using mitre joints and also",
      " Creativity and imagination : the learner will make thoughtful choices in selecting solfa syllables and note values to",
      " Critical thinking and Problem solving: developed when the learner listens and recognises sol-fa sounds in melodies as",
      " Creativity and Imagination - developed as the learner practises the scissors technique accompanied by a music tempo.",
      " Communication and collaboration - the learner speaks clearly and effectively while discussing the execution of the sail",
      " Digital literacy - Learner interacts with digital technology to responsibly search and watch a video on the performance of",
      " Learning to learn - learner will take initiative to learn how to play notes and melodies on the descant recorder.",
      " Citizenship: developed through playing the main melody of the Kenya National Anthem on the descant recorder.",
      " Creativity and imagination: learner makes thoughtful choices when producing a montage pictorial composition themed",
      " Critical thinking: Learner gives feedback on peers’ performance based on the videos taken.",
      " Citizenship: developed as the learner interact with and play kenyan indigenous musical instruments in an ensemble",
      " Communication and collaboration: enhanced through performance as group in an ensemble"
    ],
    "values": [
      " Responsibility: Learner works on art work and clears up after the activities",
      " Unity: Learner shares the volleyball equipment as they demonstrate the skills of dig pass and underarm service.",
      "(N.B observe integrity in producing original",
      " Respect: is instilled through use of respectful words as they appreciate and appraise each other’s collages and",
      " Integrity - displays honesty by creating own original rhythms and collages without copying from other sources.",
      "pattern and collages respectively.",
      " Responsibility: as learners put into practise the aspects of safety, care of the environment while sourcing for materials",
      " Love : Learner respects others as they practise the combination of gymnastics progressions to form a 3 phase sequence",
      " Respect: is nurtured when the learner appreciates and appraises others’ created mats, composed melodies to",
      " Respect: is developed when the learner appreciates and appraises others’ compositions.",
      " Unity: is achieved through working in groups.",
      " Integrity: is developed when creating own compositions without copying what other peers have already created.",
      " Integrity: the learner displays honesty while appraising each other's performance.",
      " Responsibility: learner watches videos on the performance of the long and high jumps, practises the latter and takes",
      " Responsibility - will be nurtured as learners observe safety and hygiene measures on their descant recorders.",
      " Respect: is instilled through use of respectful words as they appreciate and appraise each other’s performances using",
      " Unity: learner displays team spirit when they display team spirit while recording performance and later giving feedback.",
      " Responsibility: learner carries out the practices of the inverted breaststroke, produce a montage pictorial composition and",
      " Unity: achieved through playing of musical instruments in groups.",
      " Responsibility: is nurtured as the learner handles different musical instruments in the ensemble."
    ],
    "suggested_learning_experiences": [
      " Social studies- the learner identifies musical instruments from different communities covered in Social Studies.",
      " Indigenous language: the learner names musical instruments using the words from the indigenous communities of",
      "(observe the stance, grip, execution, and follow",
      " Critical thinking and problem solving: Learner will be developed as the learner explores multiple perspectives of creating",
      " Creativity and imagination: The learner will apply creative skills in selecting media for drawing, and rhythms that are",
      " Love: Learners are considerate when critiquing others’ artworks.",
      "Home science: Learners use skills of measuring, marking and stitching or pasting to applique playing kits.",
      "● listen to /sing familiar songs and are guided in",
      "● listen to/watch/perform familiar songs with taa-",
      "(N.B observe integrity in producing original",
      "● listen to songs and identify songs in three and",
      " Self-efficacy - learners will develop the ability to create and improvise rhythmic patterns",
      " Social cohesion - the learner will appreciate working together with others when clapping/tapping rhythms, improvising",
      "Mathematics - learners apply the skill of measurement when improvising three and four beat patterns to help them get the",
      "(NB: observe hygiene and safety measures"
    ],
    "source_file": "Creative_Arts_Grade_6.pdf"
  },
  "Creative_Arts_Grade_7.pdf": {
    "subject": "Creative Arts",
    "grade": 7,
    "strand": "2.0 CREATING AND PERFORMING IN CREATIVE ARTS AND SPORTS",
    "substrand": "",
    "learning_outcomes": [],
    "key_inquiry_questions": [
      "related?",
      "applied?",
      "in sports?",
      "javelin?",
      "environment?",
      "solo instruments?",
      "distance?",
      "football match?",
      "interesting?",
      "storytelling?",
      "awareness?",
      "important?",
      "society?",
      "How are components of Creative Arts and Sports applied?",
      "How are rhythmic patterns used in sports?"
    ],
    "core_competencies": [
      "● Digital Literacy: the learner interacts with digital devices while watching virtual activities of fitness and watching videos to",
      "● Critical Thinking and Problem Solving: the learner applies critical thinking to demonstrate fitness exercises from the",
      "● Citizenship: the learner appreciates diverse musical expressions thus fostering a sense of citizenship.",
      "● Communication and Collaboration: as the learner articulates ideas and collaborates with peers to refine their understanding",
      "● Learning to Learn: the learner acquires knowledge in rhythm as a fundamental component of musical creation, performance",
      "● Critical thinking and Problem-solving: as the learner composes and improvises rhythmic patterns to accompany warm-up",
      "● Learning to Learn: the learner demonstrates craftsmanship in carving a javelin implement according to the right",
      "● Creativity and Imagination: the learner selects found materials from environment to use in carving the javelin implement,",
      "● Self-efficacy: the learner develops self-efficacy, when carving a javelin implement according to the right specifications and",
      "● Self-Efficacy: the learner gains confidence through creating melodies that bear acceptable qualities.",
      "● Learning to Learn: the learner learns music notation and designs the seasonal melody card, and thus develops a novel",
      "● Digital Literacy: is enhanced by using digital notation software, gaining proficiency in contemporary music creation tools,",
      "● Communication and Collaboration: as the learner composes melody, effective communication is fostered through",
      "them, emphasising collaborative creativity.",
      "● Citizenship: the learner acquires global citizenship, by writing music using Western Music notation, an internationally",
      "● Self-efficacy: the learner develops confidence and belief in their skills and ability while engaging in a game of handball.",
      "● Digital literacy: as the learners observe virtual samples of macrame and watch virtual demonstration of passes.",
      "● Creativity and Imagination: the learner improvises materials to use in weaving the handball net using the macrame knots.",
      "● Self-Efficacy: the learner, while executing solo pieces, exhibits self-efficacy, fostering personal growth.",
      "● Digital Literacy: the learner demonstrates digital literacy in preparing and sharing musical ideas, accessing sheet music,"
    ],
    "values": [
      "● Responsibility: the learner takes responsibility for their health and well-being by participating in fitness activities.",
      "● Unity: the learner works together with others to achieve common goals in group activities, fostering a supportive and",
      "● Integrity: as the learner composes rhythm, the commitment to conveying this musical element with precision reflects a sense",
      "of integrity in their approach to musical expression.",
      "● Responsibility: as the learner composes four-bar rhythmic patterns, taking responsibility for individual contributions to the",
      "composition process is crucial in ensuring a sense of responsibility for their part in the musical collaboration.",
      "● Respect: as the learner engages in the creative and collaborative process of valuing each other's ideas and contributions to",
      "demonstrate respect among musicians to create a positive and respectful musical environment.",
      "● Unity: as the learner improvises rhythmic patterns, the collaborative nature of responding to others’ contributions promotes a",
      "● Unity: the learner assists each other in safely executing a javelin throw.",
      "● Integrity: the learner upholds integrity by adhering to basic rules, while practising a javelin throw.",
      "● Responsibility: the learner demonstrates responsibility by ensuring precision and adherence to specifications in carving a",
      "● Respect: the learner values diverse perspectives and opinions from others about the qualities of a good melody.",
      "● Patriotism: the learner incorporates Western and Kenyan cultural elements into their artistic expressions when designing the",
      "● Responsibility: the learner shows commitment to the creative processes involved in melody composing, which include",
      "● Unity: the learner works with others to collect materials to design melody cards, perform parts of the melodies and present",
      "● Responsibility: the learner exhibits responsibility by taking ownership of the net weaving, and taking responsibility for",
      "● Unity: the learner fosters unity and mutual support among teammates as they collaboratively weave a handball net.",
      "● Respect: the learner appreciates the need for respect of each other as they practise and perform handball skills thus",
      "● Unity: The learner collaborates with peers during rehearsals, fostering a sense of togetherness in the pursuit of musical"
    ],
    "suggested_learning_experiences": [
      "● English: the learner utilises language and communication skills as they discuss, and present, enhancing their linguistic",
      "● Social Science: the learner interacts with diverse societal and cultural contexts as they research the components and elements",
      "The learner is guided to:",
      "● discuss the elements of a story:",
      "● observe actual or virtual activities",
      "● Communication: the learner develops effective verbal expression and written communication skills while discussing the",
      "● Collaboration: the learner embraces teamwork and mutual support while singing familiar tunes.",
      "● Digital Literacy: the learner interacts with digital devices while watching virtual activities of fitness and watching videos to",
      "● Critical Thinking and Problem Solving: the learner applies critical thinking to demonstrate fitness exercises from the",
      "● Responsibility: the learner takes responsibility for their health and well-being by participating in fitness activities.",
      "● Unity: the learner works together with others to achieve common goals in group activities, fostering a supportive and",
      "● Citizenship: the learner appreciates diverse musical expressions thus fostering a sense of citizenship.",
      " Lifestyle diseases: The learner performs fitness activities to reduce the chances of lifestyle diseases.",
      "● English and Kiswahili: the learner enhances language comprehension and interpretation skills during group discussions and",
      "● Mathematics: the learner employs learnt mathematical principles of rhythm, values, timing, during music notation."
    ],
    "source_file": "Creative_Arts_Grade_7.pdf"
  },
  "Creative_Arts_Grade_9.pdf": {
    "subject": "Creative Arts",
    "grade": 9,
    "strand": "1.0: FOUNDATIONS OF CREATIVE ARTS",
    "substrand": "",
    "learning_outcomes": [],
    "key_inquiry_questions": [
      "and Sports?",
      "composition?",
      "fitness?",
      "music notation?",
      "painting?",
      "affect the mood?",
      "simple time?",
      "the environment?",
      "interesting?",
      "photography?",
      "to an audience?",
      "performance?",
      "communicating?",
      "Basketball?",
      "pottery?"
    ],
    "core_competencies": [
      "● Communication and collaboration: the learner enhances communication skills during research and collaborates with peers",
      "● Learning to learn: the learner develops research skills as they search and organise information on careers in Creative Arts",
      "● Communication and Collaboration: the learner articulates and shares their understanding of various creative arts genres with",
      "● Learning to Learn: the learner engages in independent research to understand the unique aspects of Creative Arts and Sports",
      "● Critical Thinking and Problem Solving: the learner engages in analysis of components and their roles in Creative Arts and",
      "● Communication and Collaboration: The learner engages in effective communication by describing and discussing and",
      "● Learning to Learn: The learner actively research/ review on texture and colour; and discuss unity/harmony",
      " Communication and Collaboration: The learner, through effective communication, articulates and discusses the effect of",
      " Learning to Learn: The learner actively seeks to understand and apply notation conventions to represent rhythm in music.",
      " Critical Thinking and Problem Solving: The learner creatively solves problems related to achieving the desired solutions on",
      " Creativity and Imagination: The learner embraces creativity by exploring innovative factors such as unique combinations of",
      " Learning to Learn: the learner gains knowledge performing Triple jump and long distance running skills and gives feedback",
      " Self-efficacy: the learner shows confidence in taking up new challenges and believes in performing new skills in athletics.",
      " Critical Thinking and Problem Solving: learners make decisions and decide on the skill to apply at a particular phase while",
      " Creativity and Imagination: the learner creates an artistic themed mosaic composition for describing the long distance races.",
      " Citizenship: the learner searches and makes a mosaic of Kenyan long distance athletes.",
      " Citizenship: learner appreciates Kenyan athletes as they create mosaic compositions of their favourite Kenyan athletes.",
      " Creativity and Imagination: The learner explores innovative techniques to create variation in melodies.",
      " Learning to Learn: The learner applies knowledge gained from earlier grades on the process of melody composition.",
      " Communication and Collaboration: The learner communicates with peers as they discuss how variation has been achieved"
    ],
    "values": [
      "● Respect: the learner accommodates others opinions as they discuss the different personnel in Creative Arts and Sports in",
      "● Unity: the learner works with others in groups as they search for information on careers and personnel in Creative Arts and",
      "● Responsibility: the learner uses digital devices appropriately while observing netiquette.",
      " Unity: the learner strengthens teamwork as they collaboratively research and do presentations on the components of",
      "harmony/unity in a",
      "harmony/unity,",
      "discuss unity/harmony,",
      "discuss unity/harmony.",
      "● Learning to Learn: The learner actively research/ review on texture and colour; and discuss unity/harmony",
      "● Respect: The learner respects the significance of Visual Arts by valuing the elements and principles as essential components",
      "● Unity: The learner collaboratively display their scenery composition in a working portfolio for critique.",
      "harmony/unity",
      " Unity: the learner in collaborating with others on rhythm composition projects creates a harmonious atmosphere.",
      " Responsibility: the learner takes responsibility for their part in the ensemble while playing in unison or in two-part music,",
      " Responsibility: the learner cares for self and others, as they participate in skills for long distance running and triple jump",
      "integrity,",
      " Unity: The learner collaborates with others in discussions about variation techniques in melody writing.",
      " Responsibility: The learner ensures accuracy and clarity in representing melodies, taking responsibility for conveying",
      " Integrity: The learner strives to be true to their artistic vision, avoiding plagiarism and embracing originality in the creation",
      " Integrity: The learner upholds a high standard of integrity by respecting the rules of the game and engaging in skill acquisition"
    ],
    "suggested_learning_experiences": [
      "Question: 2.0 Creating and Performing 2.6 Photography (8 lessons)  Photography  scenic points (geographical features, building among others)  view point (normal, birds and worm)  presentation; arrangement of photographs, caption,",
      "The learner is guided to:",
      "discuss careers in Creative Arts and",
      "centres) to observe roles performed",
      " discuss to identify different",
      "● Communication and collaboration: the learner enhances communication skills during research and collaborates with peers",
      "while discussing careers in Creative Arts and Sports.",
      "● Learning to learn: the learner develops research skills as they search and organise information on careers in Creative Arts",
      "● Respect: the learner accommodates others opinions as they discuss the different personnel in Creative Arts and Sports in",
      "● Unity: the learner works with others in groups as they search for information on careers and personnel in Creative Arts and",
      "● Responsibility: the learner uses digital devices appropriately while observing netiquette.",
      "● Life Skills education: the learner gains decision making skills as they explore different careers in Creative Arts and Sports,",
      "● Social cohesion: the learner visits various Creative Arts and Sports spaces to interact with different personnel involved in",
      "Pre-Technical Studies: the learner enhances digital skills as they research careers and develop entrepreneurial skills learnt in",
      "business studies and they engage in income-earning performances."
    ],
    "source_file": "Creative_Arts_Grade_9.pdf"
  },
  "English_Grade_7.pdf": {
    "subject": "English",
    "grade": 7,
    "strand": "1.2 Reading",
    "substrand": "1.2.1 Extensive",
    "learning_outcomes": [],
    "key_inquiry_questions": [
      "session?",
      "by name?",
      "narratives?",
      "clearly?",
      "good storyteller?",
      "counted?",
      "a speaker?",
      "passage?",
      "write poems?",
      "interesting?",
      "paragraphs?",
      "speaker?",
      "reading?",
      "logically?",
      "correctly?"
    ],
    "core_competencies": [
      " Critical Thinking and Problem Solving is developed as learner searches, collects, processes, and uses information from",
      " Learning to Learn is enhanced as the learner is motivated to learn continuously and work collaboratively while engaging in",
      " Digital Citizenship and Cyber wellness is enhanced as the learner searches online for examples of common proper and",
      " Creativity and imagination is enhanced as the learner undertakes the task of retelling a trickster narrative.",
      " Learning to Learn is developed as the learner collaborates with peers to suggest ways of correcting bad handwriting habits.",
      " Creativity and Imagination is developed as learner undertakes tasks such as creating and retelling narratives, which require",
      " Self-efficacy is enhanced as learners recite poems on HIV and AIDS with confidence.",
      " Learning to Learn is enhanced as learners build on their learning experiences through analysis of the setting and research",
      " Critical thinking is developed as learners explore the links between different events through tasks like creating graphic",
      " Digital literacy is developed as learners use digital devices as they play online games and record dialogues.",
      " Self-efficacy is achieved as learners pay attention to detail while role-playing and recording dialogues.",
      " Digital literacy is achieved as the learner uses digital devices to search online for expressions that signal the main idea and",
      " Communication and collaboration are developed as the learner engages in conversations in pairs using verbs in various",
      " Digital literacy is achieved as the learner uses digital devices to search sources online for different poems and notes the",
      " Creativity and imagination are developed as the learner writes narrative paragraphs and shares with peers.",
      " Critical Thinking is developed as the learner listens and selects general and specific information from oral texts.",
      " Learning to learn is developed as the learner shares what they have learnt using a mind map showing the main idea",
      " Digital literacy is enhanced as the learner manipulates digital devices while searching online and watching",
      " Self-efficacy is developed as the learner builds on their learning experiences while constructing grammatically",
      " Learning to learn is developed as the learner shares ideas on how the characters make the story flow."
    ],
    "values": [
      "related to personal responsibility",
      " Respect is developed as learners avoid distracting others by observing good reading habits.",
      " Responsibility is nurtured as the learner is guided in selecting material that they consider appropriate for self and as they",
      " Patriotism: is promoted as learners identify with their locality as they talk about people, places, and institutions in their",
      "community.",
      "share how personal responsibility can be",
      " Integrity is enhanced as learner relates the moral in the trickster narrative to real-life situations.",
      "personal responsibility on charts",
      " Respect is achieved as learners copy given texts on the theme of personal responsibility and display on charts for peer",
      " Patriotism is achieved as learners compose and perform narratives on national values.",
      " Unity is enhanced as learners work together to identify the different types of nouns in the classroom.",
      " Respect is achieved as learners take turns to work with peers to create posters using the learnt nouns.",
      " Unity is enhanced as the learner develops skills for working in harmony with others while participating.",
      " Unity is achieved as learners give each other feedback on charts and posters featuring the use of punctuation",
      " Respect is enhanced as the learner listens keenly to peers read descriptive texts and note the main ideas.",
      " Respect is enhanced as the learner shares ideas as they work with peers to infer meanings of words",
      " Respect is inculcated as the learner reviews peers’ use of tenses.",
      "while observing integrity and cyber",
      " Integrity is achieved as the learner searches online or offline for poems while observing cyber security.",
      " Respect is promoted as the learner gives feedback on the narrative paragraphs they have reviewed."
    ],
    "suggested_learning_experiences": [
      "Question(s) 1.2 Reading 1.2.1 Extensive",
      "Reading (2 lessons)",
      "Question(s) 1.4 Reading 1.4.1",
      "Question(s) 2.2 Reading 2.2.1 Intensive reading:",
      "Question(s) 2.4 Reading 2.4.1 Intensive",
      "Class Reader (2 lessons)",
      "Pertinent and Contemporary Issues (PCIs)  Creative thinking is developed as the learner creates charts to summarise what they have learned.",
      "Question(s) 3.1 Listening and",
      "Listening for the main idea (2 lessons)",
      "Question(s) 3.4. Reading 3.4.1",
      "Speaking 4.1.1 Listening",
      "Listening (2 lessons)",
      "Questions 4.2. Reading 4.2.1",
      "Pertinent and Contemporary Issues (PCIs)  Effective communication is enhanced as the learner uses the appropriate tense to discuss leadership.  Good governance is enhanced as the learner constructs sentences on leadership.",
      "Question(s) 5.2 Reading 5.2.1 Synonyms and Antonyms (2 lessons)"
    ],
    "source_file": "English_Grade_7.pdf"
  },
  "English_Grade_8.pdf": {
    "subject": "English",
    "grade": 8,
    "strand": "LISTENING AND SPEAKING",
    "substrand": "",
    "learning_outcomes": [
      "use grammatical forms to communicate appropriately in different settings,",
      "apply digital literacy skills to enhance proficiency in English,"
    ],
    "key_inquiry_questions": [
      "telephone?",
      "conversation?",
      "read widely?",
      "reading text?",
      "communicating?",
      "you read it?",
      "in a story?",
      "handwriting?",
      "it interesting?",
      "passage?",
      "plurals?",
      "desire to live?",
      "punctuated?",
      "writing?",
      "listening to a text?"
    ],
    "core_competencies": [
      "3. develop critical thinking skills for life,",
      "8. apply digital literacy skills to enhance proficiency in English,",
      "9. appreciate the role of English as a medium for creativity and talent development.",
      " Digital literacy: It is enhanced as the learner uses the telephone to make calls under the guidance of the teacher.",
      " Learning to learn: It is enhanced as the learner gains assertiveness and independence when they select reading materials.",
      " Communication and collaboration: It is enhanced as the learner work with peers categorise compound nouns",
      " Self-efficacy: It is enhanced as the learner shows concerted attention to detail when forming separate and hyphenated",
      " Learning to learn: It is enhanced as the learner engages in self- driven tasks while using compound nouns in sentences.",
      " Critical thinking: It is promoted as the learner assesses the relationship between their own lives and those of the characters in",
      " Citizenship: It is promoted as the learner cites issues on human rights.",
      " Learning to learn: It is enhanced as the learner completes tasks on time as he writes texts legibly and neatly.",
      " Self-efficacy: It is enhanced as the learner’s confidence in written communication is boosted.",
      " Creativity and imagination: This is enhanced as the learner writes songs on scientific innovations.",
      " Digital literacy: It is enhanced as the learner uses digital devices to record and watch performances then discuss non-verbal",
      "Citizenship: It is fostered as the learner watches Drama and Music Festival performances from different communities fostering",
      " Critical thinking and problem-solving: It is enhanced as the learner relates the message in the poem to real life and explores",
      " Learning to learn: It is enhanced as the learner shares what they have learnt while discussing plural forms of collective nouns.",
      " Communication and collaboration: It is developed as the learner contributes to group decision making while constructing",
      " Digital literacy: It is enhanced as the learner manipulates digital devices while looking at different places at different times.",
      " Imagination and creativity: These are brought out as the learner undertakes tasks that encourage artistic expression while"
    ],
    "values": [
      "conducted in such a manner that it will accord all learners a level playing field irrespective of the class reader they have studied.",
      "Respect: It is inculcated as the learner appreciates diverse opinions while taking turns during telephone conversations.",
      "Responsibility: It is developed as the learner engages and helps peers in selecting reading materials.",
      "Respect: It is promoted as the learner displays patience while working with peers to identify the compound nouns in the text.",
      "Responsibility: It is promoted as the learner takes different roles to dramatise the events in the story.",
      "Responsibility: This is enhanced as the learner legibly and neatly writes words and sentences related to human rights.",
      "Patriotism: It is fostered as the learner appreciates their culture while singing the different uniting songs.",
      "social cohesion and patriotism.",
      "Responsibility: It is enhanced as the learner engages in writing poems on scientific innovations in groups.",
      " Unity: It is developed as the learner collaborates with peers to construct sentences using the collective nouns they have",
      " Respect: It is developed as the learner appreciates the capabilities of others as they work in groups.",
      "Unity: It is fostered as the learner displays team spirit while working with peers to compare the setting in the short story with",
      "Respect: It is inculcated as the learner assesses peers’ work while tolerating any errors of punctuation.",
      "Responsibility: It is cultivated as the learner acquires knowledge about how to take care of the environment from the cause and",
      "Patriotism: It is fostered as the learner acquires knowledge on pollution and how to improve the environment by reading varied",
      "Respect: It is enhanced as the learner helps peers in constructing sentences correctly.",
      "Respect: It is enhanced as the learner respects diverse opinions while engaging in discussions and writing of poems on pollution.",
      "Unity: This is enriched as the learner works patiently with peers to identify conjunctions in paragraphs.",
      "Responsibility: It is enhanced as the learner listens to texts on consumer roles and responsibilities.",
      "Unity: It is enhanced as the learner collaboates with peers to complete the mind map."
    ],
    "suggested_learning_experiences": [
      "Inquiry Question(s) 1.1 Listening and Speaking 1.1.1 Polite",
      "Question(s) 1.2 Reading 1.2.1Extensive",
      "Reading (2 lessons)",
      "Inquiry Question(s) 2.2 Reading 2.2.1 Intensive",
      "Reading: Simple poems (2 lessons)",
      "Inquiry Question(s) 2.4 Reading 2.4.1 Intensive",
      "Reading: Short story (Class Reader) (2 lessons)",
      "Inquiry Question (s) 3.2 Reading 3.2.1 Intensive",
      "Inquiry Question(s) 3.4 Reading 3.4.1 Intensive reading:",
      "Inquiry Question(s) 4.1 Listening and Speaking 4.1.1 Listening",
      "Listening (2 lessons)",
      "Inquiry Question(s) 4.2. Reading 4.2.1 Intensive",
      "Inquiry Question(s) 4.4 Reading 4.4.1 Intensive",
      "Reading: Short story (Class",
      "Reader) (2 lessons)"
    ],
    "source_file": "English_Grade_8.pdf"
  },
  "English_Grade_9.pdf": {
    "subject": "English",
    "grade": 9,
    "strand": "1.3 Grammar",
    "substrand": "1.3.1 Gender",
    "learning_outcomes": [],
    "key_inquiry_questions": [
      "communication?",
      "took place?",
      "legibly?",
      "paragraphs?",
      "important?",
      "twisters?",
      "correctly?",
      "in writing?",
      "attentively?",
      "comprehension?",
      "phrases?",
      "obligation?",
      "stories?",
      "coherently?",
      "well formed?"
    ],
    "core_competencies": [
      " Learning to learn takes place as the learner builds on their own learning experience when selecting reading materials",
      " Critical thinking and problem solving is promoted as the learner follows simple instruction to develop a good reading culture",
      " Self-efficacy is nurtured as the learner shows cocerted attention when creating a reading log",
      " Self-efficacy is enhanced as the learner shows concerted attention when forming different types of sentences using gender",
      " Critical thinking and problem solving is enhanced as the learner analyses concepts by logical reasoning to fill in a crossword",
      "critical thinking.",
      " Communication and collaboration is promoted as learner contributes to group decision making when working in groups",
      " Creativity and imagination is nurtured as the learner exchanges ne ideas that inspire creative thinking when role-playing",
      "Nationalism is promoted as the learner analyses and comes up with a play related to the theme on Citizenship.",
      " Digital literacy is enhanced as the learner interacts with digital content to research on the advantages of a neat and legible",
      " Learning to learn takes place as the learner is motivated to learn continually by taking notes while listening to a text",
      " Communication and collaboration is developed as the learner uses riddles, tongue twisters and proverbs",
      " Critical thinking and problem solving is enhanced as the learner connects ideas to solve riddles",
      "Self-efficacy is nurtured as the learner recites poems",
      "Learning to learn is encouraged as the learner studies on their own",
      "Communication and collaboration is enhanced as the learner reads and recites poems",
      " Learning to learn is enhanced as the learner searches for more examples of quantifiers from books, newspapers, magazines,",
      " Learning to learn is enhanced as the learner analyses and writes a summary of the events in a play",
      " Communication and collaboration is developed as the learner interacts with others in groups",
      " Self-efficacy is enriched as the learner uses punctuation marks correctly in writing"
    ],
    "values": [
      " Responsibility is inculcated as the learner engages in assigned roles when searching for reading materials, reads, and keeps a",
      " Integrity is enhanced as the learner displays transparency in using the internet when searching for online fiction and non-",
      "Unity is enhanced as the learner cooperates with peers when participating in group tasks",
      " Respect is enhanced as the learner accomodates diverse opinions when reading sections of a poem or story and pick out",
      " Unity is promoted as the learner collaborates with peers to role play some of the actions and characters in a play",
      " Responsibility are enhanced as the learners cooperate with peers when working in groups",
      " Responsibility is cultivated as the learner exhibits self-driven attitude when working at improving their handwriting and",
      " Respect is enhanced as the learner ensures positive regard for others when reviewing a text written by a peer",
      "internet, and the community,",
      "Unity is encouraged as the learner appreciates the effort of peers when participating in riddling games",
      "Unity is cultivated as the learner colllaborates with others to recite poems",
      "Respect is fostered as the learner displays patience when taking turns to read and respond to different lines in a poem",
      "Unity is fostered as the learner collaborates with others to identify count and non-count nouns in small groups",
      "Responsibility is nurtered as the learner offers guidance to others when helping each other in identifying and using",
      "Unity is enhanced as the learner collaborates with peers to complete a task",
      " Unity is strengthened as the learner shares available resources when working in groups to complete tasks",
      " Patriotism is promoted as the learner exhibits consciousness of their social duties when acquiring knowledge on how to",
      " Responsibility is inculcated as the learner acknowledges their roles and responsibilities when being sensitised on ways of",
      "Respect is developed as the learner understands and appreciates others when working with peers to complete tasks",
      "Respect is inculcated as learners appreciates diverse opinions when participating in group activities to complete tasks"
    ],
    "suggested_learning_experiences": [
      "when selecting reading materials  Critical thinking and problem solving is promoted as the learner follows simple instruction to develop a good reading culture  Self-efficacy is nurtured as the learner shows cocerted attention when creating a reading log",
      "Social cohesion is developed as learner shares reading materials and experiences",
      "Question (s) 2.2 Reading 2.2.1 Intensive",
      "Question (s) 3.1 Listening and Speaking 3.1.1 Listening",
      "Question (s) 3.4 Reading 3.4.1",
      "Question (s) 4.3 Grammar in Use 4.3.1 Present and Past",
      "Question (s) 4.4 Intensive Reading 4.4.1 Play:",
      "Question (s) 5.4 Reading 5.4.1 Play:",
      "Question (s) 6.1 Listening and Speaking 6.1.1 Conversational skills: Negotiation skills (2 Lessons)",
      "Question (s) 6.4 Reading 6.4.1 Intensive",
      "Reading – Play (2 Lessons)",
      "Speaking 7.1.1 Listening",
      "Question (s) 7.4 Reading 7.4.1 Intensive",
      "By the end of the sub strand, the learner should be able to: a) outline the stages of the writing process, b) create a composition, story or poem following the steps of the writing process, c) advocate the need for creativity in life.",
      "Question (s) 8.1 Listening and Speaking 8.1.1 Oral"
    ],
    "source_file": "English_Grade_9.pdf"
  },
  "Indigenious_Languages_Grade_9.pdf": {
    "subject": "Indigenious Languages",
    "grade": 9,
    "strand": "Listening and Speaking",
    "substrand": "",
    "learning_outcomes": [],
    "key_inquiry_questions": [
      "heroines?",
      "comprehension?",
      "society?",
      "legibly?",
      "miscommunication?",
      "technology?",
      "important?",
      "friends?",
      "another?",
      "service?",
      "and society?",
      "passage?",
      "conversation?",
      "public places?",
      "stories important?"
    ],
    "core_competencies": [
      " Communication and Collaboration: This is enhanced as the learner engages actively using facts and examples when",
      " Digital Literacy: It is enhanced as the learner interacts with digital content when listening to an audio recording on",
      " Critical Thinking and Problem-solving: This is enhanced as the learner follows simple instructions during the spelling-bee",
      " Citizenship: It is promoted as the learner accumulates information when reading a text on community heroes and heroines",
      " Citizenship: This is promoted as the learner demonstrates tolerance when assessing other’s work according to the criteria",
      " Learning to Learn: This is developed as the learner builds on their own learning experiences when using the discussion",
      " Digital Literacy: This is developed as the learner interacts with digital content when listening to recordings of stories based",
      " Communication and collaboration: It is developed as the learner speaks engagingly with facts and examples when",
      " Creativity and Imagination: This is enhanced as the learner exchanges new ideas that inspire creative thinking when",
      " Self-efficacy: It is enhanced as the learner effectively orders and prioritises tasks when developing a vocabulary bank on",
      " Digital literacy: This is promoted as the learner uses technology skills when working jointly with peers to create an email",
      " Critical Thinking and Problem Solving: The learner analyses concepts by logical reasoning when conducting a debate on",
      " Communication and Collaboration: The learner contributes to group decision making when working with peers to identify",
      " Learning to Learn: This is enhanced as the learner plans and manages time effectively to prepare and present a short talk",
      " Citizenship: The learner accumulates varied reading resources on people who have served their communities well and",
      " Critical thinking and problem-solving: The learner explores views when discussing key considerations when using the",
      " Creativity and Imagination: The learner exchanges new ideas that inspire creativity when working with peers to compose",
      " Communication and Collaboration: This is enhanced as the learner works jointly with peers to brainstorm ideas to consider",
      " Digital Literacy: This is promoted as the learner uses digital technology to accomplish tasks when searching from online",
      " Citizenship: It is enhanced as the learner works collaboratively to develop a constructive dialogue when conducting a"
    ],
    "values": [
      "THEME 1: COMMUNITY HEROES AND HEROINES",
      "Suggested Vocabulary: hero, heroine, community, save, serve, leader, patriotic, unite, celebrate, brave, coward",
      "community heroes and heroines,",
      "report on a community hero or heroine",
      "community",
      "community heroes and heroines.",
      " Respect: This is developed as the learner accommodates diverse opinions when discussing with peers the various ways of",
      " Responsibility: It is enhanced as the learner diligently takes up assigned roles when working with peers to roleplay a news",
      "report on a community hero and heroine of choice.",
      "Good Governance: The learner interacts with texts on community heroes and heroines and identifies the qualities of an ethical",
      "The learner is able to relate information derived from the texts on community heroes and heroines to the concept of",
      " read a text on community heroes",
      "community heroes and heroines",
      " Citizenship: It is promoted as the learner accumulates information when reading a text on community heroes and heroines",
      " Unity: It is promoted as the learner cooperates with peers to conduct a spelling-bee mini-contest to spell of the vocabulary",
      "Social Cohesion: The is promoted as the learner interacts with texts on community heroes and heroines.",
      " Patriotism: The learner exhibits honesty when peer assessing other’s work for correct spelling.",
      " Respect: It is instilled as the learner appreciates diverse opinions during the discussion on characteristics of a good",
      "Good Governance: This is promoted as the learner interacts with texts and knowledge on community heroes and heroines.",
      "The learner is able to relate the concept around the theme of community heroes and heroines to leadership in Social Studies."
    ],
    "suggested_learning_experiences": [
      "Question(s) 1.1 Listening and",
      "Inquiry Question(s) 1.2 Reading 1.2.1 Reading for",
      "when using the discussion findings to create a criteria or checklist for assessing good handwriting.",
      "Question(s) 2.1 Listening and Speaking 2.1.1 Listening for",
      "Identifying main idea ",
      "Question(s) 2.2 Reading 2.2.1 Reading for",
      "Question(s) 3.1 Listening and Speaking 3.1.1 Pronunciation (2 lessons) ",
      "Question(s) 3.2 Reading 3.2.1 Extensive",
      "Inquiry Question(s) 4.1 Listening and Speaking 4.1.1 Conversation skills- Negotiation (2 lessons)",
      "Inquiry Question(s) 4.2 Reading 4.2.1 Extensive reading – short stories (2 lessons) ",
      "Question(s) 5.1 Listening and Speaking 5.1.1 Presentation",
      "Inquiry Question(s) 5.2 Reading 5.2.1 Reading for Information – Plays (2 lessons)",
      "Inquiry Question(s) 6.1 Listening and Speaking 6.1.1 Intensive",
      "Listening (2 lessons)  Riddles  Tongue twisters",
      "Inquiry Question(s) 6.2 Reading 6.2.1 Reading for"
    ],
    "source_file": "Indigenious_Languages_Grade_9.pdf"
  },
  "Intergrated_Science_Grade_7.pdf": {
    "subject": "Intergrated Science",
    "grade": 7,
    "strand": "2.0: Mixtures, Elements and Compounds",
    "substrand": "",
    "learning_outcomes": [],
    "key_inquiry_questions": [
      "laboratory?",
      "the laboratory?",
      "important?",
      "expressed?",
      "to day life?",
      "during adolescence?",
      "adolescence?",
      "be maintained?",
      "environment?",
      "day life?",
      "day-to-day life?",
      "What safety measures should be considered while working in the laboratory?",
      "How are quantities in science expressed?",
      "How are developmental changes managed during adolescence?",
      "How can a healthy excretory system be maintained?"
    ],
    "core_competencies": [
      "● Learning to learn: The learner develops relationships while role-playing some First Aid procedures for common accidents in the laboratory",
      "● Critical thinking and problem solving: The learner reflects while role-playing some First Aid procedures for common accidents in the laboratory and",
      "● Learning to learn: The learner reflects on their own work as they practise how to use and care for apparatus and instruments in the laboratory.",
      "● Communication and collaboration: The learner develops teamwork as they collect packaging featuring labels of quantities and discuss the importance",
      "● Communication and collaboration: The learner works with peers to identify and record different types of mixtures in school and at home.",
      "● Learning to learn: The learner practices to learn independently as they use appropriate methods of separating mixtures in day to day life.",
      "Critical thinking and problem solving: The learner develops research skills as they explore applications of acids and bases using print or digital media.",
      "Self-Efficacy: The learner develops self-awareness as they explore applications of acids and bases and present findings.",
      "● Self-efficacy: The learner successfully develops a plan to manage developmental challenges during adolescence.",
      "● Communication and collaboration: The learner contributes to group discussions on the physical changes that take place in boys and girls during",
      "● Communication and Collaboration: The learner clearly records and shares information on healthy lifestyles that promote kidney and skin health.",
      "● Self-efficacy: The learner successfully develops a daily log on activities that promote skin and kidney health.",
      "● Learning to learn: The learner shares learnt knowledge as they use digital or print media to search for more information on electrical",
      "● Citizenship: The learner exercises responsible use of the different sources of electricity within their locality.",
      "● Communication and collaboration: The learner develops communication skills as they discuss the applications of magnets.",
      "● Self-efficacy: The learner manages assigned tasks by attentively using a permanent magnet to test different materials, sort and classify them into"
    ],
    "values": [
      "Responsibility: The learner exercises accountability as they practise safety measures in the laboratory and the general school learning environment.",
      "● Respect: The learner appreciates others’ opinions while working in groups as they discuss the use of basic skills in science,",
      "Responsibility: The learner cares for apparatus and instruments as they practise how to care and use them in the laboratory.",
      "● Unity: The learner cooperates with peers as they work in groups to separate mixtures",
      "Responsibility: The learner engages in assigned roles as they carry out activities to prepare acid-base indicators from plant extracts collaboratively.",
      "Respect: The learner appreciates diverse opinions of peers as they collaboratively use digital or print media to explore applications of acids and bases",
      "Integrity The learner shows self-discipline in coping with developmental challenges during adolescence.",
      "Respect: The learner appreciates others as they learn about the uniqueness of their bodies.",
      "● Unity: The learner shares available resources with others as they study the skin and the kidney.",
      "● Unity: The learner works harmoniously with peers as they set up simple electrical circuits in series and parallel.",
      "● Patriotism: The learner practises dedication in setting up simple electrical circuits in series and parallel while working in groups.",
      "● Responsibility: The learner diligently engages in assigned roles when carrying out activities to investigate the nature of force between different",
      "● Respect: The learner exercises patience with one another as they discuss the various applications of magnets.",
      "Guidelines for Grade 7 Community Service-Learning Project",
      "Community Service Learning (CSL) is an experiential learning strategy that integrates classroom learning and community service to enable learners",
      "reflect, experience and learn from the community. The CSL activity is hosted as a strand in Social Studies. The Social Studies teacher will be expected",
      "Learners study their community to understand the challenges faced and their effects on community members.",
      "Exhibitions involve showcasing learners’ project items to the community and reflecting on the feedback"
    ],
    "suggested_learning_experiences": [
      "The learner is guided to:",
      "● discuss causes of common laboratory",
      "● discuss the importance of safety measures in",
      "● Learning to learn: The learner develops relationships while role-playing some First Aid procedures for common accidents in the laboratory",
      "● Critical thinking and problem solving: The learner reflects while role-playing some First Aid procedures for common accidents in the laboratory and",
      "Responsibility: The learner exercises accountability as they practise safety measures in the laboratory and the general school learning environment.",
      "● Socio economic issue: The learner practises safety precautions in the laboratory.",
      "● discuss the use of basic skills in science,",
      "discuss the importance of the information on labels.",
      "● Learning to learn: The learner reflects on their own work as they practise how to use and care for apparatus and instruments in the laboratory.",
      "● Communication and collaboration: The learner develops teamwork as they collect packaging featuring labels of quantities and discuss the importance",
      "● Respect: The learner appreciates others’ opinions while working in groups as they discuss the use of basic skills in science,",
      "Responsibility: The learner cares for apparatus and instruments as they practise how to care and use them in the laboratory.",
      "● Socio economic issues: The learner appropriately disposes off any broken equipment as they practise use and care for apparatus and instruments in the",
      "● discuss meaning of the terms solvent,"
    ],
    "source_file": "Intergrated_Science_Grade_7.pdf"
  },
  "Intergrated_Science_Grade_8.pdf": {
    "subject": "Intergrated Science",
    "grade": 8,
    "strand": "1.0: MIXTURES, ELEMENTS AND COMPOUNDS",
    "substrand": "",
    "learning_outcomes": [],
    "key_inquiry_questions": [
      "day life?",
      "affect its properties?",
      "of fire in nature?",
      "out of a cell?",
      "be managed?",
      "environment?",
      "and liquids?",
      "How is energy transformation applied in day-to-day life?"
    ],
    "core_competencies": [
      "● Learning to learn: The learner reflects on their own experiences as they identify elements and compounds on labels of",
      "● Communication and collaboration: The learner writes clearly the symbols of elements, compounds, word equations.",
      "● Critical thinking and Problem Solving: The learner uses logical reasoning during the discussion of the characteristics of",
      "● Digital literacy: The learner gains digital literacy as they use digital media search for the information on movement of",
      "● Citizenship: The learner enhances active community life skills by making posters on classes of fires and their control",
      "● Communication and collaboration: The learner acquires listening, speaking and recording skills as they discusses the causes",
      "● Learning to learn: The learner learns how to prepare, mount, observe and draws plant cells as seen under a light microscope.",
      "● Self-efficacy: The learner successfully prepares and observes specimens under the light microscope.",
      " Communication and collaboration: The learner acquires writing skills as while recording findings from experiments to",
      " Self-efficacy: The learner executes assigned tasks successfully while carrying out experiments to demonstrate diffusion and",
      "● Learning to learn: The learner organises own learning while searching for information from print and non-print materials on",
      "● Self-efficacy: The learner appreciates and successfully manages challenges related to the menstrual cycle.",
      " Critical thinking and problem solving: The learner reflects on how to solve energy shortage by transforming energy",
      " Creativity and imagination: The learner experiments with ideas to test workability of energy transformation in day-to-day",
      "● Learning to Learn: The learner uses digital or print media to search for information on the applications of pressure in solids"
    ],
    "values": [
      "Unity: The learner cooperates and harmoniously works with others while identifying elements and compounds from sample",
      "Unity: The learner cooperates and harmoniously works with peers as they carry out simple experiments to determine the boiling",
      "● Citizenship: The learner enhances active community life skills by making posters on classes of fires and their control",
      "● Respect: The learner observes rules of engagement while working with peers to classify fire according to the cause and",
      "● Responsibility: The learner accommodates each other’s views and opinions as they discuss rights to safety information on",
      "● Unity: The learner displays team spirit as they prepare, mount, observe and draw plant cells as seen under a light microscope.",
      "● Responsibility: The learner performs assigned roles as they observe, draw and label animal cells on permanent slides as seen",
      " Respect: The learner appreciates the opinions of peers when discussing the roles of diffusion and osmosis in living",
      " Responsibility: The learner executes assigned roles while carrying out experiments to demonstrate diffusion and",
      "● Respect: The learner shows open mindedness while discussing symptoms of common STIs and their prevention.",
      "Unity: The learner collaboratively and harmoniously comes together while discussing the applications of pressure in solids and",
      "APPENDIX 1: GUIDELINES FOR INTEGRATING COMMUNITY SERVICE LEARNING (CSL) PROJECT",
      "Community Service Learning (CSL) is an experiential learning strategy that integrates classroom learning and community",
      "service to enable learners reflect, experience and learn from the community. The CSL activity is hosted as a strand in Social",
      "Learners study their community to understand the challenges faced and their effects on community members.",
      "Exhibitions involve showcasing learners’ project items to the community and reflecting on the feedback",
      "community problems."
    ],
    "suggested_learning_experiences": [
      "The learner is guided to:",
      "● discuss the meaning of atoms,",
      "compounds or observe",
      "● Learning to learn: The learner reflects on their own experiences as they identify elements and compounds on labels of",
      "● Communication and collaboration: The learner writes clearly the symbols of elements, compounds, word equations.",
      "Financial literacy: The learner explores the value of common elements and compounds in society as they learn about importance",
      "Unity: The learner cooperates and harmoniously works with others while identifying elements and compounds from sample",
      "The learner is able to relate the use of ingredients and items made from the common elements and compounds learnt in",
      "discuss the trends,",
      "discuss the effects of",
      "discuss the applications of",
      "● Critical thinking and Problem Solving: The learner uses logical reasoning during the discussion of the characteristics of",
      "● Digital literacy: The learner gains digital literacy as they use digital media search for the information on movement of",
      "Safety and security: The learner observes safety to avoid burns while carrying out simple experiments to determine the boiling",
      "Unity: The learner cooperates and harmoniously works with peers as they carry out simple experiments to determine the boiling"
    ],
    "source_file": "Intergrated_Science_Grade_8.pdf"
  },
  "Intergrated_Science_Grade_9.pdf": {
    "subject": "Intergrated Science",
    "grade": 9,
    "strand": "2.0: LIVING THINGS AND THEIR ENVIRONMENT",
    "substrand": "",
    "learning_outcomes": [
      "Construct food chains"
    ],
    "key_inquiry_questions": [
      "drinking?",
      "animals feed?",
      "human body?",
      "environments?",
      "day life?",
      "Why is hard water preferred for drinking?",
      "How is food digested in the human body?"
    ],
    "core_competencies": [
      "● Communication and collaboration: The learner works with peers to discuss the composition of common alloys",
      "● Digital literacy: The learner interacts with digital technology as they search for information using digital devices on physical",
      "● Learning to learn: The learner reflects on their experiences as they apply methods of softening hard water in day to day life.",
      "● Critical thinking and problem solving: The learner develops interpretation skills as they relate the lathering ability of water to",
      "● Learning to learn: The learner searches for information on photosynthesis, discusses and shares with peers.",
      "● Self-efficacy: The learner successfully carries out experiments on conditions necessary for photosynthesis and shares the",
      "● Communication and Collaboration: The learner listens to others as they discuss the process of digestion in human",
      "● Learning to learn: The learner searches for information on fertilisation and fruit formation in flowering plants.",
      "● Digital literacy: The learner uses digital devices to search for information on the effect of agrochemicals on pollinating agents",
      "● Citizenship: The learner develops a sense of responsibility to the nation while searching for information on interrelationships",
      "● Critical thinking and problem solving: The learner shows open-mindedness while investigating the interrelationships",
      "● Self-efficacy: The learner exercises leadership skills as they discuss with peers the characteristics of images formed by curved mirrors.",
      "● Communication and Collaboration: The learner develops listening and writing skills while discussing with peers the terms",
      "● Learning to learn: The learner does investigations as they use digital or print media to search for more information on the",
      "● Creativity and Imagination: The learner experiments with various activities as they carry out activities to demonstrate generation of"
    ],
    "values": [
      "● Respect: The learner accommodates others’ opinions during group discussions on uses of metals and common alloys.",
      "● Responsibility: The learner plays a role when carrying out experiments on softening hard water.",
      "● Respect: The learner gives each other an opportunity to air their views as they discuss in a group the differences between hard",
      "● Integrity: The learner displays honesty while carrying out experiments to show that light, carbon (IV) oxide and chlorophyll are",
      "● Unity: The learner collaborates with others as they study dentition in different animals.",
      "● Respect The learner appreciates others’ opinions while discussing different modes of nutrition in animals.",
      "● Citizenship: The learner develops a sense of responsibility to the nation while searching for information on interrelationships",
      "● Patriotism: The learner develops love for the country as they search for information on interrelationships between organisms in",
      "● Peace: The learner shows respect for diversity and heritage as they study the interdependence between living and non-living",
      "● Social justice: The learner exercises equity and accord equal opportunity to group members as they discuss the characteristics",
      "● Responsibility: The learner exercises excellence as they illustrate image positions for various object positions in concave and convex",
      "● Respect: The learner exercises open mindedness as they embrace discussions on different ideas on applications of waves in day to day",
      "to identify and solve some community",
      "In Grade 9, learners will undertake an integrated Community Service Learning (CSL) project of choice from a single or combined",
      "community. The implementation of the integrated CSL project will take a Whole School Approach, where all members of the",
      "school community including teachers, school administration, parents/guardians/ local community and support staff. It will be a",
      "Pertinent and Contemporary Issues (PCIs) for the CSL project. It should also provide an opportunity for development of core",
      "Learners study their community to understand the challenges faced and their effects on community",
      "Some of the challenges in the community can be:",
      "● Violence and conflicts in the community"
    ],
    "suggested_learning_experiences": [
      "Pertinent and Contemporary Issues (PCIs) for the CSL project. It should also provide an opportunity for development of core competencies and nurturing of values. Learners will undertake a variety of integrated CSL group projects in teams of following a 6-step milestone approach as follows:",
      "Learners study their community to understand the challenges faced and their effects on community members.",
      "Learners create an intervention to address the challenge identified.",
      "Learners share roles, create a list of activities to be undertaken, mobilise resources needed to create their intervention and set timelines for execution",
      "The learners execute the project and keep evidence of work done.",
      "Exhibitions involve showcasing learners’ project items to the community and reflecting on the feedback",
      "Learners write a report detailing their project activities and learnings from feedback",
      "Learners review all project work to learn from the challenges faced.",
      "● Communication and collaboration: The learner works with peers to discuss the composition of common alloys",
      "● Digital literacy: The learner interacts with digital technology as they search for information using digital devices on physical",
      "● Financial Literacy: The learner appreciates the importance of metals and common alloys in day to day life as they discuss the",
      "● Respect: The learner accommodates others’ opinions during group discussions on uses of metals and common alloys.",
      "● Peace: The learner avoids harming others when carrying out experiments to demonstrate the physical properties of metals",
      "● Pre- Technical Studies: The learner learns about common metals and alloys used in workshops.",
      "● Agriculture and Nutrition: The learner uses utensils made from metals and their alloys."
    ],
    "source_file": "Intergrated_Science_Grade_9.pdf"
  },
  "IRE_Grade_7.pdf": {
    "subject": "Ire",
    "grade": 7,
    "strand": "1.0 Qur’an",
    "substrand": "",
    "learning_outcomes": [
      "Describe, performs and"
    ],
    "key_inquiry_questions": [
      "selected surah?",
      "the selected surah?",
      "intention?",
      "friends?",
      "Tawheed?",
      "a Muslim?",
      "avoid shirk?",
      "prayers?",
      "prayers important?",
      "pay Zakat?",
      "good morals?",
      "truthful?",
      "forgiveness?",
      "drug abuse?",
      "the society?"
    ],
    "core_competencies": [
      " Communication and collaboration: Listening and speaking skills as the learners listen and discuss in groups, the stages of",
      " Self-efficacy: effective communication skills as learners communicate with clarity when individually narrating the first",
      " Digital Literacy: skills of interacting with digital technology as the learners search and watch videos on the incident of",
      " Learning to learn: the skill of developing relationships as learners share the learnt knowledge through class presentation",
      " Citizenship: Social Cohesion as learners navigate through group dynamics when discussing in groups the stages of the",
      "Digital literacy: The learner interacts with digital technology when researching online on the teachings/lessons from the",
      "Citizenship: Social and civic skills as learners dramatize teachings/lessons from the selected surah (treatment of orphans,",
      "Learning to learn: The learners develop relationships as they share learnt knowledge during class presentations on",
      " Citizenship: Social cohesion is promoted as the learners dramatize the teachings lessons from the selected surah",
      "self-efficacy,",
      " Critical Thinking and Problem Solving: the learners identify and use available networks to access and share information on",
      " Creativity and imagination: Communication and self-expression as learners artistically prepare charts on forms of Hadith",
      " Digital literacy: skills of digital Citizenship as the learner observe safety precautions and practices when using digital",
      " Citizenship: Active Community Life Skills as learners become socially aware on the choice of friends to make.",
      " Self-efficacy: knowing who I am as learners create social groups to share information",
      " Communication and collaboration: Teamwork when the learners observe the rules of engagement during role play on the",
      " Communication and collaboration: Skills of listening, speaking, writing and team work as learners listen, appreciate and",
      " Critical thinking and problem solving since the learners acquire the skill of reflection when researching on the ways of",
      " Digital Literacy: Skills of interacting with digital devices when searching and downloading materials on the ways of",
      " Citizenship: Social cohesion as learners discuss in groups the significance of Tawheed."
    ],
    "values": [
      " Respect: open mindedness as learners interact and respect each other’s opinion in groups during discussion on the stages",
      " Unity: cooperation as learners discuss in pairs the importance of the Quran.",
      "respect for parents and humility)",
      " Respect: As the learners dramatize the ways of showing respect and humility to the parents.",
      "(treatment of orphans, respect for parents and humility).",
      " Unity as learners cooperate to work as a team to prepare charts on forms of Hadith for display",
      " Respect: patience as they appreciate diverse opinions during discussions in groups",
      " Citizenship: Active Community Life Skills as learners become socially aware on the choice of friends to make.",
      " Responsibility: Accountability as learners make choice of friends when creating social groups.",
      " Life Skills: Taking responsibility for choice of friends when creating social groups to share information.",
      "respect the opinion of others when discussing the significance of Tawheed in groups and make notes.",
      " Unity: the learners cooperate as they discuss in groups.",
      "Unity as learners cooperate during discussion on the effects of shirk.",
      "respect the opinion of others when discussing in groups the significance of congregational prayers, Sunnah prayers and",
      " Responsibility: accountability as learners demonstrate the performance of congregational prayers, Sunnah prayers and",
      " Unity as learners cooperate to search and watch video clips/ other resources on how congregational prayers, Sunnah",
      " Respect: Open mindedness as learners respect each other’s opinion while discussing the different types of Zakat and make",
      " Unity as learners cooperate in research on items exempted from Zakat and make class presentations.",
      "Responsibility: Accountability through research on the significance of Saum.",
      " Citizenship: Active Community Life Skills as learner discuss the purpose of morality"
    ],
    "suggested_learning_experiences": [
      " Communication and collaboration: Listening and speaking skills as the learners listen and discuss in groups, the stages of",
      " Self-efficacy: effective communication skills as learners communicate with clarity when individually narrating the first",
      " Digital Literacy: skills of interacting with digital technology as the learners search and watch videos on the incident of",
      " Learning to learn: the skill of developing relationships as learners share the learnt knowledge through class presentation",
      " Respect: open mindedness as learners interact and respect each other’s opinion in groups during discussion on the stages",
      " Unity: cooperation as learners discuss in pairs the importance of the Quran.",
      " Citizenship: Social Cohesion as learners navigate through group dynamics when discussing in groups the stages of the",
      "a) read surah Ad-Dhuha (Q.93:1-",
      "c) discuss the teachings/lessons of",
      "The learner is guided",
      " read the selected",
      " discuss the meaning",
      "Digital literacy: The learner interacts with digital technology when researching online on the teachings/lessons from the",
      "Citizenship: Social and civic skills as learners dramatize teachings/lessons from the selected surah (treatment of orphans,",
      "Learning to learn: The learners develop relationships as they share learnt knowledge during class presentations on"
    ],
    "source_file": "IRE_Grade_7.pdf"
  },
  "Kiswahili-Grade_8.pdf": {
    "subject": "Kiswahili",
    "grade": 8,
    "strand": "1.0 USAFI WA SEHEMU ZA UMMA",
    "substrand": "",
    "learning_outcomes": [],
    "key_inquiry_questions": [
      "mahojiano?",
      "nani? nini? wapi? lini?) katika?",
      "cha simulizi?",
      "maandishi?",
      "mawasiliano?",
      "na /gh/?",
      "uliyoisoma?",
      "kutoa shukrani?",
      "namna gani?",
      "vipengele gani?",
      "ya kubuni?",
      "vimilikishi?",
      "umuhimu gani?",
      "ufasaha?",
      "masimulizi?"
    ],
    "core_competencies": [],
    "values": [],
    "suggested_learning_experiences": [],
    "source_file": "Kiswahili-Grade_8.pdf"
  },
  "Kiswahili_Grade_7.pdf": {
    "subject": "Kiswahili",
    "grade": 7,
    "strand": "1.0 USAFI WA KIBINAFSI",
    "substrand": "",
    "learning_outcomes": [],
    "key_inquiry_questions": [
      "unaowasilishwa?",
      "mazungumzo?",
      "ufahamu?",
      "cha simulizi?",
      "maandishi?",
      "kawaida?",
      "za aina gani?",
      "kujisomea?",
      "kutoa mwaliko?",
      "nyumbani?",
      "andishi?",
      "ya kubuni?",
      "ili apate kulala?",
      "kwa ufasaha?",
      "masimulizi?"
    ],
    "core_competencies": [],
    "values": [],
    "suggested_learning_experiences": [],
    "source_file": "Kiswahili_Grade_7.pdf"
  },
  "Kiswahili_Grade_9.pdf": {
    "subject": "Kiswahili",
    "grade": 9,
    "strand": "1.0 USAFI WA MAZINGIRA",
    "substrand": "",
    "learning_outcomes": [],
    "key_inquiry_questions": [
      "mjadala?",
      "usahihi?",
      "maandishi?",
      "wakati gani?",
      "matini ya kusoma?",
      "ya kujichagulia?",
      "ya kirafiki?",
      "vinatofautianaje?",
      "simulizi?",
      "kueleweka zaidi?",
      "mawasiliano?",
      "vitendawili?",
      "mambo gani?",
      "ya masimulizi?",
      "katika sentensi?"
    ],
    "core_competencies": [],
    "values": [],
    "suggested_learning_experiences": [],
    "source_file": "Kiswahili_Grade_9.pdf"
  },
  "Maths Grade 7": {
    "subject": "Maths Grade 7",
    "grade": null,
    "strand": "2.0: ALGEBRA",
    "substrand": "",
    "learning_outcomes": [],
    "key_inquiry_questions": [
      "daily activities?",
      "real life?",
      "activities?",
      "situations?",
      "different objects?",
      "figures?",
      "measure volume?",
      "everyday lives?",
      "temperature?",
      "buying or selling?",
      "transactions?",
      "1. What are angles?",
      "life situations?",
      "constructions?",
      "collect data?"
    ],
    "core_competencies": [
      "● Creativity and imagination: Making connections as learners work in groups to create songs and poems on divisibility",
      "● Critical thinking and problem solving: Interpretation and inference as learners apply the GCD and the LCM in solving",
      "● Creativity and imagination: Observed as learners create puzzles involving fractions.",
      "● Critical thinking and problem solving: Evaluation and decision making as learners apply fractions using cut outs, cards,",
      "● Citizenship as learners carry out division of fractions which implies sharing",
      "● Critical thinking and problem solving: Open mindedness and creativity as learners identify and use the place value and",
      "● Digital literacy: Interacting with technology; as learners use IT gadgets to learn more on decimals.",
      "● Critical thinking and problem solving: Reflection as learners use grid squares and charts to find squares and square",
      "● Digital literacy: Interacting with technologies as learners use IT devices to work out squares and square roots of",
      "● Communication and collaboration: Speaking, listening and team work; as learners discuss in groups on formation of",
      "● Critical thinking and problem solving: Interpretation and inference; as learners factorize algebraic expressions",
      "● Communication and collaboration: Speaking, listening and team work as learners’ role play activities involving",
      "● Self-efficacy: Self-awareness skills as learners carry out weighing using beam balance and role play.",
      "● Learning to learn: Organizing own learning as learners apply linear equations in real life.",
      "● Communication and collaboration: Speaking and listening as learners discuss on how to form the linear inequalities.",
      "● Creativity and Imagination: Open mindedness and creativity as learners draw and represent inequality statements on a",
      "● Critical thinking and problem solving: Interpretation and inference as learners identify Pythagorean relationship in",
      "● Creativity and imagination: Open mindedness and creativity as learners create Pythagorean relationship puzzles.",
      "● Learning to learn: Sharing learnt knowledge as learners apply Pythagorean relationship in real life situations.",
      "● Communication and collaboration: Speaking, listening and team work; as learners work in pairs/groups when"
    ],
    "values": [
      "● Unity as learners sing together or solve puzzles on factors.",
      "● Respect for self and others as learners work in groups to write factors of composite numbers using factor tree.",
      "● Responsibility: as learners perform multiplication and division of fractions when sharing or allocating resources.",
      "● Unity as learners work in groups to multiply and divide decimals using cut outs, cards, charts and models.",
      "● Responsibility as learners perform multiplication and division of decimals.",
      "● Respect as learners appreciate each other’s contribution in groups in using grids and charts",
      "● Unity as learners work in groups and work out the factors of numbers to get the square roots.",
      "● Unity as learners classify/group similar objects in groups.",
      "● Respect as learners appreciate each other’s contribution while discussing and forming algebraic expressions.",
      "● Integrity as learners share resources as per the given equation (conditions).",
      "● Responsibility: as learners use a given letter in the equation to represent an item.",
      "● Integrity as learners observe the conditions of the given inequalities.",
      "● Unity as learners carry out various activities together, such as creating Pythagorean relationship puzzles.",
      "● Respect as learners appreciate each other’s opinions when identifying and applying Pythagorean relationship in real life",
      "● Integrity as learners carry out the activities and give the correct measurement.",
      "● Unity as learners work in groups measuring lengths of various objects.",
      "● Responsibility as the learner cuts out the small sectors of the circle and joins them up to form a rectangle.",
      "● Integrity as learners work out exact areas of different shapes.",
      "● Unity as learners work in groups and share tasks in measuring the area.",
      "● Responsibility as learners work in groups and share different tasks in making models."
    ],
    "suggested_learning_experiences": [
      "● Creativity and imagination: Making connections as learners work in groups to create songs and poems on divisibility",
      "● Critical thinking and problem solving: Interpretation and inference as learners apply the GCD and the LCM in solving",
      "● Unity as learners sing together or solve puzzles on factors.",
      "● Respect for self and others as learners work in groups to write factors of composite numbers using factor tree.",
      "● Self-awareness as learners work in groups to create songs and poems on divisibility tests",
      "● Education for Sustainable Development (ESD) as learners use locally available materials for making number cards and",
      "Agriculture and nutrition; as learners apply LCM or GCD as they plan for smallest or largest containers for measuring",
      "The learner is guided to:",
      "● discuss and arrange fractions in",
      "● use flip cards to discuss",
      "● Creativity and imagination: Observed as learners create puzzles involving fractions.",
      "● Critical thinking and problem solving: Evaluation and decision making as learners apply fractions using cut outs, cards,",
      "● Social justice: as learners share things fairly",
      "● Responsibility: as learners perform multiplication and division of fractions when sharing or allocating resources.",
      "● Citizenship as learners carry out division of fractions which implies sharing"
    ],
    "source_file": "Maths Grade 7"
  },
  "Maths_Grade_8.pdf": {
    "subject": "Maths",
    "grade": 8,
    "strand": "1.0: NUMBERS",
    "substrand": "Fractions",
    "learning_outcomes": [],
    "key_inquiry_questions": [
      "situations?",
      "of integers?",
      "decimals?",
      "numbers?",
      "activities?",
      "expressions?",
      "two unknowns?",
      "real life situations?",
      "a circle?",
      "in money?",
      "hire purchase?",
      "polygons?",
      "Cartesian plane?",
      "real life?",
      "in real life?"
    ],
    "core_competencies": [
      " Creativity and imagination- creating games: as the learner plays creative games that involve number lines, for example",
      " Learning to learn: as the learner represents integers on the number line.",
      " Digital literacy- interacting with technologies: as the learner uses IT devices to learn and play games on integers.",
      "Citizenship: as the learner discusses and uses the correct order of operations in fractions in some aspects such as populations.",
      "Critical thinking and problem solving: as the learner works out operations on fractions from model shopping activities,",
      " Citizenship: as the learner works together with others, discusses and classifies non- recurring and recurring decimals.",
      " Critical thinking and problem solving: as the learner practices converting recurring decimals to fractions.",
      " Communication and collaboration: as the learner works with peers to read and write the square roots of numbers from",
      " Imagination and creativity: as the learner reads and writes the square roots of numbers from tables.",
      "Critical thinking and problem solving: as the learner carries out different activities such as calling using different service",
      "Imagination and creativity: as the learner uses hourglass to show indirect relationships.",
      "Critical thinking and problem solving: as the learner discusses like and unlike terms to factorize and simplify algebra.",
      "Communication and collaboration: as the learner discusses and uses substitution methods to find the solutions of simultaneous",
      "Citizenship: as the learner role plays shopping activities on two different items in the shop to form linear equations in two",
      " Communication and collaboration: as the learner discusses and finds the circumference of different circular objects in the",
      " Creativity and imagination: as the learner uses cut outs to relate arc length to the circumference of a circle.",
      "● Critical thinking and problem solving: as the learner uses cut outs of sectors of circles from locally available materials and",
      " Learning to learn: as the learner uses models to find the surface area of cubes, cuboids and cylinders and derive the",
      " Communication and collaboration: as the learner gathers information about simple and compound interests offered on",
      " Critical thinking and problem solving: as the learner determines Appreciation and Depreciation using step by step methods"
    ],
    "values": [
      " Respect: as the learner works with peers to play games that involve integers.",
      " Unity: as the learner works together in creating games on integers.",
      "Responsibility: as the learner plays games of operations on fractions using IT devices or other resources.",
      "Respect: as the learner works together to work out operations on fractions from shopping activities.",
      " Responsibility: as the learner discusses and classifies non- recurring and recurring decimals.",
      " Respect: as the learner works with peers to discuss and classify non- recurring and recurring decimals.",
      " Respect: as the learner appreciates each other’s contribution in creating games that involve squares and square roots of",
      " Unity: as the learner works in teams to play games involving squares and square roots of numbers.",
      "Respect: as the learner shares out different quantities of items in given ratios",
      "Responsibility: as the learner discusses and substitute values in algebraic expressions.",
      "Responsibility: as the learner practices forming and solving simultaneous equations in two unknowns of real life cases",
      " Integrity: as the learner draws circles of given dimensions and work out the circumference of a circle.",
      " Responsibility: as the learner makes any objects with the sector that can be used in real life situations.",
      "Responsibility through excellence as the learner uses models to find the surface area of triangular prisms.",
      "Responsibility: as the learner makes responsible choices on shopping goods that they appreciate in value.",
      "Responsibility: as the learner constructs regular polygons using pair of compasses, rulers and protractors and take care of the",
      "Respect: is enhanced as the learner discusses and appreciate others’ views to make an appropriate table of values for a given",
      " Responsibility: as the learner makes scale drawings on different learning materials using appropriate scale.",
      "Responsibility, love and respect: as the learner works with peers to collect solids and make models.",
      " Responsibility: as the learner uses IT devices or other resources such as coins, balls in the study of probability."
    ],
    "suggested_learning_experiences": [
      "By the end of the sub- strand the learner should be able to: a) factorize algebraic expressions in different situations b) simplify algebraic fractions in different situations c) evaluate algebraic expressions by substituting numerical",
      "Representation and",
      "the learner should be able to:",
      "e) reflect on use of integers",
      "The learner is guided to:",
      " Creativity and imagination- creating games: as the learner plays creative games that involve number lines, for example",
      " Learning to learn: as the learner represents integers on the number line.",
      " Digital literacy- interacting with technologies: as the learner uses IT devices to learn and play games on integers.",
      " Respect: as the learner works with peers to play games that involve integers.",
      " Unity: as the learner works together in creating games on integers.",
      "Environmental education: as the learner uses available resources and spaces to jump steps.",
      "Integrated Science: as the learner works out different arithmetic’s in Science that involve integers.",
      "discuss and use the correct",
      "discuss and carry out",
      "Citizenship: as the learner discusses and uses the correct order of operations in fractions in some aspects such as populations."
    ],
    "source_file": "Maths_Grade_8.pdf"
  },
  "Maths_Grade_9.pdf": {
    "subject": "Maths",
    "grade": 9,
    "strand": "2.0: ALGEBRA",
    "substrand": "",
    "learning_outcomes": [
      "Explain the variables and",
      "Discuss, sketch and make a scale",
      "Discuss and note down",
      "Discuss the relationship",
      "Use digital devices or maps",
      "Use this information to",
      "Discuss how packaging can be"
    ],
    "key_inquiry_questions": [
      "situations?",
      "numbers in powers?",
      "proportions?",
      "work fast?",
      "life situations?",
      "activities?",
      "surfaces?",
      "objects?",
      "another?",
      "citizens?",
      "quantities?",
      "real life?",
      "triangle?",
      "community need?",
      "on a project?"
    ],
    "core_competencies": [
      " Communication and collaboration- speaking and listening; as learners work in groups to use stacks of cubes to",
      " Imagination and creativity- open mindedness and creativity; as learners determine both the cube and cube root and relate",
      " Critical thinking and problem solving; as learners show the laws of indices using multiplication and division.",
      " Self-efficacy; as learners discuss and relate powers of 10 to common logarithms",
      " Citizenship- active community life skills; as learners work in pairs/groups to discuss and divide quantities into",
      " Critical thinking and problem solving- interpretation and inference; as learners work out rates of work.",
      "● Communication and collaboration - as learners discuss use of tables to represent matrices.",
      "● Learning to learn - as learners arrange items or elements in rows and columns to form matrices.",
      "● Citizenship - as learners discuss how to use travel schedules to different places.",
      "● Digital literacy - as learners IT or others resources to explore steepness or gradient of places.",
      "● Learning to learn - as learners place the ladder at different points on the ground as they discuss and compare steepness.",
      "● Digital literacy - as learners use IT resources to present linear inequalities.",
      "● Communication and collaboration - as learners discuss and generate table of values and draw linear inequalities.",
      "Citizenship - as learners discuss and indicate the regions that satisfy inequalities.",
      "● Communication and collaboration - as learners work in groups to discuss the properties of regular polygons and use cut",
      "● Creativity and imagination - as learners open nets of different models and work out surface area.",
      "● Critical thinking and problem solving - as learners identify and work out the volume of a frustum from a pyramid",
      "● Creativity and Imagination - as learners identify, discuss and work out volume of solids.",
      "● Communication and collaboration - as learners discuss the relationship between mass and weight.",
      "● Creativity and imagination - as learners determine the density of different materials or objects."
    ],
    "values": [
      " Respect; as learners appreciate each other’s contribution in pairs/groups discussion.",
      " Responsibility; as learners take their roles in turns to lead the groups in discussions on indices.",
      " Unity; as learners measure capacity in groups.",
      " Citizenship- active community life skills; as learners work in pairs/groups to discuss and divide quantities into",
      " Responsibility; as learners commit to working out answers of given tasks on rates.",
      " Respect for self and others; as learners in pairs/groups and work out rates of work.",
      "Integrity - as learners organize objects in rows and columns and give the order of the matrix",
      "Integrity - as learners observe gradient/steepness in staircases in buildings, bridges or ramps.",
      "Responsibility - as learners take care and work out surface area using models and open nets of different objects.",
      "Patriotism - as learners collect objects from the environment, use and dispose of them safely.",
      "● Responsibility - as learners take care of the models of pyramids, cones, and spheres.",
      "● Patriotism - as learners collect objects from the environment to determine and discuss models/objects for different volumes",
      "● Integrity - as learners give correct masses and weights of different material and objects.",
      "● Responsibility - as learners work and take care of weighing machines and other resources.",
      "in school or community.",
      "● Integrity- as learners correctly record individual running time during track events and other games.",
      "● Respect - as learners adhere to their lanes on track events and other games.",
      "● Integrity - as learners accurately work out currency, import and exchange rates.",
      "● Integrity - as learners measure different quantities and minimize errors.",
      "● Responsibility - as learners take care of tools for measuring different quantities."
    ],
    "suggested_learning_experiences": [
      " discuss the volume of a",
      " read the cube of",
      " Communication and collaboration- speaking and listening; as learners work in groups to use stacks of cubes to",
      " Imagination and creativity- open mindedness and creativity; as learners determine both the cube and cube root and relate",
      " Respect; as learners appreciate each other’s contribution in pairs/groups discussion.",
      "Learners use stacks of cubes to demonstrate the concept of cube and cube roots, relate to objects in the environment.",
      "Learners use new terms in reading measurements of length in cubes as learnt in Languages.",
      "the learner should be able to;",
      "Learners is guided to:",
      " discuss indices and",
      " discuss and relate powers",
      " Critical thinking and problem solving; as learners show the laws of indices using multiplication and division.",
      " Self-efficacy; as learners discuss and relate powers of 10 to common logarithms",
      " Responsibility; as learners take their roles in turns to lead the groups in discussions on indices.",
      " Unity; as learners measure capacity in groups."
    ],
    "source_file": "Maths_Grade_9.pdf"
  },
  "Pre_Technical_Studies_Grade_8.pdf": {
    "subject": "Pre Technical Studies",
    "grade": 8,
    "strand": "2.0: COMMUNICATION",
    "substrand": "",
    "learning_outcomes": [],
    "key_inquiry_questions": [
      "hardware used?",
      "investors?",
      "traders?",
      "important?",
      "environment?",
      "to scale?",
      "in daily life?",
      "identified?",
      "cared for?",
      "determined?",
      "business?",
      "prepared?",
      "budgeting?",
      "selected?",
      "investing?"
    ],
    "core_competencies": [
      "Critical Thinking and Problem Solving: learner develops skills of interpretation and inference when categorising computer",
      "● Learning to Learn: learner acquires skills of organising self-learning when searching for information on the importance of",
      "● Communication and Collaboration: learner develops writing, speaking, listening and teamworking skills when discussing,",
      "● Communication and Collaboration: learner acquires writing, listening, speaking and team working skills when discussing",
      "● Learning to Learn: learner acquires organising self-learning skills when using available resources to explore the channels",
      " Learning to Learn: the learner acquires the skill to reflect on own work when practicing drawing of plane figures to a given",
      " Self-Efficacy: the learner acquires intrinsic self-motivation when drawing plane figures to scale.",
      "● Communication and Collaboration: Learner develops speaking, listening and teamworking skills when discussing the",
      "● Critical Thinking and Problem Solving: Learner develops open mindedness and creativity skills when applying effects",
      " Communication and Collaboration: Learner acquires speaking, listening and teamworking skills when discussing the",
      " Digital Literacy: Learner acquires interacting with technology skills when using digital devices to search for information",
      "● Critical Thinking and Problem Solving: Learner acquires evaluation and decision-making skills when collecting items made",
      "● Citizenship: Learner demonstrates social cultural sensitivity and awareness when visiting workplaces in the locality to",
      "● Learning to Learn: learner acquires the skill of working collaboratively with others when discussing the use of cutting tools",
      "● Critical Thinking and Problem Solving: Learner acquires evaluation and decision-making skills when demonstrating safe",
      " Critical Thinking and Problem-Solving: Learner acquires evaluation and decision-making skills when calculating assets,",
      " Self-Efficacy: Learner develops effective communication skills when discussing, presenting and preparing statements of",
      "● Communication and Collaboration: Learner acquires writing, speaking, listening and team working skills when sharing",
      "● Critical Thinking and Problem Solving: Learner acquires evaluation skills when preparing a simple personal budget.",
      "● Communication and Collaboration: Learner acquires writing, speaking, listening and team working skills when discussing"
    ],
    "values": [
      "respective categories,",
      "● Respect: learner shows patience when brainstorming and presenting on the meaning and importance of consumer and",
      "● Responsibility: learner shows resilience when searching for information on the importance of consumer and investor",
      "● Unity: learner cooperates with other members when sharing experiences on ways in which consumers and investors",
      "● Respect: learner shows humility when debating on ethical practices in communication.",
      "● Unity: learner cooperates with other members of the team when discussing and presenting the factors considered when",
      " Unity: the learner enhances cooperation with peers when discussing how to read plain scales",
      " Responsibility: the learner demonstrates self-drive when practicing drawing plane figures to a given plain scale.",
      "Responsibility: Learner engages in assigned roles and duties when using visual programming software to create instructions in",
      "Peace: The learner portrays respect for diversity when visiting workplaces in the locality to explore the uses of composite",
      "● Responsibility: Learner engages in assigned roles and duties when collecting items made of ceramic materials in the",
      "● Unity: Learner collaborates with others when using a chart to match ceramic materials with their use in the work",
      "● Responsibility: learner observes safety precautions when using cutting tools available to perform given tasks.",
      "● Unity: learner respects other people’s opinions when discussing the use of cutting tools in the work environment.",
      "● visit the local community to assess",
      " Responsibility: Learner performs tasks assigned when calculating assets, liabilities and capital using the bookkeeping",
      " Respect: Learner shows regard for the input of every member of the team when discussing the components of a statement",
      "● Integrity: Learner develops ethical practices when budgeting and spending money.",
      "● Responsibility: Learner performs tasks assigned when brainstorming and presenting on the importance of budgeting.",
      "● Respect: Learner appreciates diverse opinions of others when sharing experiences on the meaning and sources of income"
    ],
    "suggested_learning_experiences": [
      "The learner is guided to:",
      "● discuss the categories of",
      "Peer Education and Mentorship: learner enhances leadership skills when discussing the categories of computer hardware",
      "The learner is able to relate the skills used to perform tasks using input, output and storage devices to all learning areas when",
      "● discuss and present on ways in",
      "● engage a resource person to discuss",
      "● read and analyse a case study on",
      "● Communication and Collaboration: learner develops writing, speaking, listening and teamworking skills when discussing,",
      "The learner is able to relate the skills used in consumer rights to human rights in Social Studies.",
      "the learner should be able to:",
      "● discuss and present the",
      "● read and analyse a case",
      "● Communication and Collaboration: learner acquires writing, listening, speaking and team working skills when discussing",
      "● Unity: learner cooperates with other members of the team when discussing and presenting the factors considered when",
      "The learner is able to relate the forms and channels of communication as a learner learns communication skills to English ."
    ],
    "source_file": "Pre_Technical_Studies_Grade_8.pdf"
  },
  "Pre_Technical_Studies_Grade_9.pdf": {
    "subject": "Pre Technical Studies",
    "grade": 9,
    "strand": "2.0: COMMUNICATION",
    "substrand": "",
    "learning_outcomes": [],
    "key_inquiry_questions": [
      "nurtured?",
      "development?",
      "day-to-day life?",
      "important?",
      "technical fields?",
      "software?",
      "day-to–day life?",
      "materials?",
      "workplace?",
      "services?",
      "problems?",
      "business?",
      "entrepreneur?",
      "prepared?",
      "Why is self- exploration necessary for career development?"
    ],
    "core_competencies": [
      " Creativity and Imagination: learner acquires networking skills by undertaking group activities and exchanging new ideas that",
      " Critical Thinking and Problem Solving: learner interprets and makes inference when reading and analysing a case study on",
      " Learning to Learn: learner develops self-learning skill when reading and analysing a case study on ethical and unethical",
      " Self-Efficacy: learner acquires effective communication skills when organising and participating in talent shows to nurture",
      " Digital Literacy: learner develops creating with technology skills when performing tasks using different application",
      " Learning to Learn: learner develops relationships by sharing what they have learnt with peers when discussing categories of",
      " Communication and Collaboration: learner develops speaking, listening and self-expression skills when brainstorming on",
      " Critical Thinking and Problem Solving: learner develops interpretation and inference skills when drawing three-",
      "● Self-Efficacy: effective communication skills are developed as the learner discuss the application areas of visual",
      "● Critical Thinking and Problem Solving: open-mindedness and creativity skills are developed as the learner develops an",
      " Digital Literacy: learner develops digital skills when interacting and manipulating digital devices to search for",
      " Learning to learn: learner organises own learning when searching for information on the types of wood used at the",
      " Digital Literacy: learner acquires digital skills when using digital devices to search for information on hazardous materials.",
      " Learning to Learn: learner develops the skill of sharing learnt knowledge when discussing safe ways of handling hazardous",
      " Communication and Collaboration: learner develops listening and speaking skills when discussing the use of holding tools.",
      " Learning to Learn: learner reflects on own work when demonstrating safe use of holding tools to perform given tasks.",
      " Digital Literacy: learner develops digital skills when interacting and manipulating audio visual aids on safe use of holding",
      " Self-Efficacy: learner acquires effective communication skills in task execution when demonstrating safe use of driving",
      " Digital Literacy: learner develops interacting skills when manipulating audio visual devices on safe use of driving tools.",
      " Learning to Learn: learner acquires skills of organising self-learning when analysing case studies on different distribution"
    ],
    "values": [
      "● Integrity: learner develops accountability when analysing a case study on ethical and unethical practices related to the use",
      " Respect: learner shows humility by displaying positive regard for self and others when discussing and presenting on ways",
      " Responsibility: learner shows determination by engaging in assigned roles and duties when organising and participating in",
      " Integrity: learner exhibits fairness by giving equal opportunities to peers when brainstorming functions of application",
      " Responsibility: learner cares for the print or digital media as well as drawing instruments when learning how to draw three",
      " Unity: learner cooperates with others when using digital devices to search for information on and discussing characteristic",
      " Unity: learner cooperates with others when sharing print or digital media to search for information on types of wood.",
      " Respect: learner accepts diverse opinions when discussing methods of wood preparation.",
      " Respect: learner appreciates diverse opinions as they brainstorm on hazardous materials found in the workplace.",
      " Unity: learner cooperates with others when discussing on the safe use of holding tools.",
      " Responsibility: learner exercises accountability as they maintain and store holding tools.",
      " Unity: learner cooperates with others when discussing on the safe use of driving tools.",
      " Responsibility: learner exercises accountability as they maintain and store driving tools.",
      "the community.",
      " Respect: learner shows regard for self and others when discussing the meaning of channels of distribution and role of",
      " Responsibility: learner engages in assigned roles and duties when debating on ethical issues on distribution of goods and",
      " Peace: learner displays tolerance and respect for others when debating on ethical issues on distribution of goods and",
      " Responsibility: learner cares for tools and materials when making the item.",
      " Respect: learner appreciates diverse opinions of others as they discuss possible items that can be made to solve the",
      " Responsibility: learner cares for own property and those of others when handling ICT devices while searching for"
    ],
    "suggested_learning_experiences": [
      "The learner is guided to:",
      " discuss and present on ways of",
      " engage with a resource person",
      "● read and discuss a case study on",
      " Critical Thinking and Problem Solving: learner interprets and makes inference when reading and analysing a case study on",
      " Learning to Learn: learner develops self-learning skill when reading and analysing a case study on ethical and unethical",
      " Respect: learner shows humility by displaying positive regard for self and others when discussing and presenting on ways",
      " discuss categories of computer",
      "presentation, spreadsheets,",
      "spreadsheet and desktop",
      " Learning to Learn: learner develops relationships by sharing what they have learnt with peers when discussing categories of",
      " English: the learner uses application software to write narrative paragraphs.",
      "Ability to observe",
      "observes safety",
      "Rarely observes"
    ],
    "source_file": "Pre_Technical_Studies_Grade_9.pdf"
  },
  "Social_Studies_Grade_7.pdf": {
    "subject": "Social Studies",
    "grade": 7,
    "strand": "1.0: SOCIAL STUDIES AND PERSONAL DEVELOPMENT",
    "substrand": "",
    "learning_outcomes": [],
    "key_inquiry_questions": [
      "choices?",
      "in society?",
      "beings come to be?",
      "world today?",
      "thousands of years?",
      "shape society?",
      "cohesion?",
      "well-being?",
      "inner peace?",
      "development?",
      "accounts?",
      "in Africa?",
      "maps used?",
      "locations?",
      "solar system?"
    ],
    "core_competencies": [
      "5.5 Citizenship",
      "● Self-efficacy: Learners reflect and journal personal abilities and interests and share with a friend in class.",
      "● Critical thinking and problem solving: Learners share previous experiences in groups how he or she dealt with emotions:",
      "● Creativity and Imagination: Learners create posters of common entrepreneurial opportunities in social studies and display in",
      "● Digital Literacy: Learners use digital or print resources to explore entrepreneurial opportunities in Social Studies.",
      "● Decision making skills: Learners develop analytical and critical thinking skills as they use digital or print resources to",
      "Communication and Collaboration: Learners engage a resource person to discuss the traditional and religious stories on human",
      "Critical thinking: Learners watch and critique audio-visual documentary on the contribution of Ancient Kingdoms to the",
      "● Communication and Collaboration: Learners contribute to group decision making as they brainstorm on the meaning of",
      "● Learning to learn: Learners use digital learning platforms for continuous learning and development as they use appropriate",
      "Communication and Collaboration: Learners speak effectively and logically as they compare barter trade and use of currency in",
      "● Self-efficacy: Learners debate and classify desirable and undesirable personality attributes.",
      "● Learning to learn: Learners develop relationships skills as the role play the importance of building healthy relationships in a",
      "● Self-efficacy: Learners",
      "● Digital literacy: Learners use digital or print resources to find out the peaceful conflict resolution processes.",
      "● Communication and collaboration: Learners develop skills of listening keenly and effectively as they discuss and brainstorm",
      "● Critical Thinking and Problem Solving: Learners develop the skill of exploring complex problems as they identify projects",
      "● Self-efficacy: Learners develop self-awareness skills as they consider the steps in a CSL project and propose ways in which",
      "● Digital Literacy: Learners use digital technology to effectively accomplish their own tasks as they find out the sources of",
      "Learning to Learn: Learners are able to complete tasks as they carry out research on animals and crops."
    ],
    "values": [
      "Community Service-Learning",
      "3.1 Community Service-Learning Project",
      "● Unity: Learners brainstorm on how to use personal abilities and interests for holistic development and make presentations in",
      "● Responsibility: Learners use print or digital resources to search for how to develop personal principles and share in class",
      "Responsibility: Learners create a poster of all entrepreneurial opportunities available in Social Studies and display it in school.",
      "Respect: Learners discuss in turns the implications of the traditional and religious stories on human origin",
      "Unity: Learners watch and critic audio-visual documentary on the contribution Ancient Kingdoms to the modern world",
      "● Unity: Learners work in groups to brainstorm on various forms of slavery and servitude in traditional African society.",
      "● Respect: Learners debate with open mind on various social injustices committed on the Africans during Indian Ocean slave",
      "● Responsibility: Learner observe safety precautions as they use print or digital resources to locate the geographical extent of",
      "Respect: Learners develop acceptance as they listen to each other as they brainstorm on the impact of the introduction of money",
      "2. Why is respect",
      "Respect: Learners develop acceptance as they listen to each other as they brainstorm personality attributes which make",
      "community,",
      "the community in day-to-",
      "person in the community",
      "community in day-to day life.",
      "school or community.",
      "community",
      "the community leaving"
    ],
    "suggested_learning_experiences": [
      "as they go through and read news articles in newspapers which promote globalisation in the community.",
      "The learner is guided to:",
      "● reflect and journal personal abilities",
      "● Self-efficacy: Learners reflect and journal personal abilities and interests and share with a friend in class.",
      "● Critical thinking and problem solving: Learners share previous experiences in groups how he or she dealt with emotions:",
      "● Unity: Learners brainstorm on how to use personal abilities and interests for holistic development and make presentations in",
      "● Responsibility: Learners use print or digital resources to search for how to develop personal principles and share in class",
      "Decision making skills: Learners reflect and journal personal abilities and interests hence and with a friend in classs.",
      "English/Kiswahili/KSL: learners use speaking and listening skills to brainstorm on personal abilities and interests for holistic",
      "● engage a relevant resource",
      "● Creativity and Imagination: Learners create posters of common entrepreneurial opportunities in social studies and display in",
      "● Digital Literacy: Learners use digital or print resources to explore entrepreneurial opportunities in Social Studies.",
      "Responsibility: Learners create a poster of all entrepreneurial opportunities available in Social Studies and display it in school.",
      "● Career exploration: Learners draw charts aligning personal talents and abilities with available entrepreneurial opportunities.",
      "● Decision making skills: Learners develop analytical and critical thinking skills as they use digital or print resources to"
    ],
    "source_file": "Social_Studies_Grade_7.pdf"
  },
  "Social_Studies_Grade_8.pdf": {
    "subject": "Social Studies",
    "grade": 8,
    "strand": "1.0: SOCIAL STUDIES AND PERSONAL MANAGEMENT",
    "substrand": "",
    "learning_outcomes": [],
    "key_inquiry_questions": [
      "characteristics?",
      "relate to you?",
      "development?",
      "community?",
      "a project?",
      "cradle of humanity?",
      "to society?",
      "slave trade?",
      "changes?",
      "Inclusion?",
      "the community?",
      "interpretation?",
      "activities?",
      "disasters?",
      "environment?"
    ],
    "core_competencies": [
      "Citizenship",
      "● Communication and Collaboration: speaking skills are developed as learners share personal life goals.",
      "● Imagination and Creativity: learners reflect on their future life goals as they watch video clips of successful career",
      "● Communication and collaboration: learners develop speaking skills as they discuss cultural beliefs that promote self-",
      "● Digital literacy: learners use digital devices to search for the relationship between self-esteem and personal productivity",
      "● Communication and Collaboration: Learners speak engagingly as they discuss and work on various CSL project/activity",
      "● Self-efficacy: Learners develop the skills of self-awareness and leadership as they undertake the CSL project.",
      "● Creativity and Imagination: Learners come up with creative ways of solving the identified problem in the community.",
      "● Critical Thinking and Problem-solving: Learners identify a community need or gaps and explore possible solutions to",
      "● Digital Literacy: Learners use technology as they search for solutions to the identified problem in the community.",
      "● Learning to learn: Learners gain new knowledge and skills as they work together to address a community problem in the",
      "● Citizenship: Learners choose a PCI that needs immediate attention in the community.",
      "● Communication and Collaboration: Learners enhance the skill of teamwork during group discussion on how scientific",
      "● Digital Literacy: Learners use digital technology to find out the places where early human remains were discovered in",
      "● Digital Literacy: Learners use digital technology to locate on a map of Europe and Asia places of origin of early",
      "● Learning to Learn: Learners reflect on their own during role-play the best practices from early civilisations to the",
      "● Digital Literacy: Learners utilise digital technology to effectively accomplish own tasks as they use digital or print",
      "● Creativity and Imagination: Learners look at a problem in a new or different way as they debate on factors that led to",
      "● Self-Efficacy: Learners develop self-confidence during illustration of demographic trends in Kenya and display in the",
      "● Creativity and Imagination: Learners exchange new ideas during research on the factors that influence migration in Africa."
    ],
    "values": [
      "Community Service Learning",
      "Community Service Learning Project",
      "● Unity: learners work together in role-playing a skit depicting values in their dream career choice in Social Studies.",
      "● Respect: learners give one another a chance to participate in discussions on personal characteristics.",
      " Responsibility: learners commit themselves through journalising actions they will take to improve their self-esteem.",
      "STRAND 2.0 COMMUNITY SERVICE LEARNING",
      "2.0 Community",
      "2.1 Community",
      "Community Service",
      "in the community,",
      "community.",
      "their school/community that",
      "community?",
      "● Creativity and Imagination: Learners come up with creative ways of solving the identified problem in the community.",
      "● Critical Thinking and Problem-solving: Learners identify a community need or gaps and explore possible solutions to",
      "● Digital Literacy: Learners use technology as they search for solutions to the identified problem in the community.",
      "● Learning to learn: Learners gain new knowledge and skills as they work together to address a community problem in the",
      "● Citizenship: Learners choose a PCI that needs immediate attention in the community.",
      "● Integrity: Learners choose to visit appropriate sites as they use digital devices to carry out research and also use resources",
      "in the process of planning to address the community problem."
    ],
    "suggested_learning_experiences": [
      "Map Reading and Interpretation",
      "The learner is guided to:",
      "selected animals, then discuss the",
      "traits and discuss,",
      "that reflect on their traits,",
      "● Communication and Collaboration: speaking skills are developed as learners share personal life goals.",
      "● Imagination and Creativity: learners reflect on their future life goals as they watch video clips of successful career",
      "Career guidance: learners identify their career paths as they watch a video clip on a successful career individual in Social",
      "● Unity: learners work together in role-playing a skit depicting values in their dream career choice in Social Studies.",
      "● Respect: learners give one another a chance to participate in discussions on personal characteristics.",
      "● Pre-technical studies: learners get career guidance on the choice of their future careers in Social Studies.",
      "● Kenyan Sign Language, Kiswahili and English: learners role-play a skit depicting values in their dream career choice in",
      "search for and discuss the",
      "● discuss cultural beliefs that promote",
      "● act out and discuss skits on examples"
    ],
    "source_file": "Social_Studies_Grade_8.pdf"
  },
  "Social_Studies_Grade_9.pdf": {
    "subject": "Social Studies",
    "grade": 9,
    "strand": "1.0: SOCIAL STUDIES AND CAREER DEVELOPMENT",
    "substrand": "",
    "learning_outcomes": [],
    "key_inquiry_questions": [
      "support?",
      "project?",
      "modern society?",
      "society?",
      "reduce poverty?",
      "the society?",
      "country important?",
      "community?",
      "in the community?",
      "important?",
      "activities?",
      "projects in society?",
      "environment?",
      "heritage sites?",
      "Kenya important?"
    ],
    "core_competencies": [
      "Learning to learn: learners engage resource persons to discuss the factors to consider in making pre career choices for selection",
      "Creativity and Imagination: learners compose and recite poems creatively to highlight the value of pre-career support system.",
      " Communication and collaboration: Learners discuss, brainstorm and consult on various project/activity processes.",
      " Self-efficacy: Learners develop the skills of self-awareness and leadership as they undertake the CSL project.",
      " Creativity and imagination: Learners come up with creative ways of solving the identified problem in the community",
      " Critical thinking and problem-solving: Learners identify a community need or gaps and explore plausible solutions to",
      " Digital literacy: Learners use technology as they search for solution to the identified problem in the community.",
      " Learning to learn: Learners gain new knowledge and skills as they discuss work together to address a community problem in",
      " Citizenship: Learners participate in CSL projects to address community challenges thereby enhancing their sense of civic",
      " Critical thinking skills: Learners brainstorm possible solutions to the identified problem in the community.",
      " Digital literacy: Learners use digital technology to access relevant learning resources on socio-economic practices of early",
      " Creativity and imagination: Learners undertake tasks and gain new perspectives as they discuss the various types of tools",
      " Creativity and imagination: Learners interact with digital technology or print media as they research on socio- economic",
      " Self-efficacy: Learners devise ways of using indigenous and modern knowledge systems to manage peer influence in the",
      " Communication and collaboration: Learners recognise the value of others' ideas as they debate on how indigenous",
      " Digital literacy: Learners interact with or watch documentaries / video clips on solutions to poverty reduction",
      " Citizenship: Learners illustrate in pairs problem solving skills to reduce poverty in the community.",
      " Creativity and imagination: Learners undertake the task of drawing and displaying age-sex population pyramid of developed",
      " Communication and collaboration: Learners work collaboratively as they discuss the significance of population structure in",
      " Citizenship: Learners acquire knowledge on population structure of Kenya and Germany together with its influence on"
    ],
    "values": [
      "Community Service-Learning",
      "2.1 Community Service-Learning Project",
      "pathways and their respective",
      "Responsibility: learners demonstrate responsibility while using digital devices/print materials to examine requirements for social",
      "Career Guidance as learners create and display charts with pathways and their respective requirements.",
      "community,",
      "in the community,",
      "Responsibility: learners explore and use appropriate support system in the community",
      "STRAND 2.0 COMMUNITY SERVICE-LEARNING",
      "2.0 Community",
      "2.1 Community",
      "the community,",
      "community problems.",
      "class/school/community that",
      " Creativity and imagination: Learners come up with creative ways of solving the identified problem in the community",
      " Critical thinking and problem-solving: Learners identify a community need or gaps and explore plausible solutions to",
      " Digital literacy: Learners use technology as they search for solution to the identified problem in the community.",
      " Learning to learn: Learners gain new knowledge and skills as they discuss work together to address a community problem in",
      " Citizenship: Learners participate in CSL projects to address community challenges thereby enhancing their sense of civic",
      "planning to address the community problem."
    ],
    "suggested_learning_experiences": [
      "as they conduct library research on types of faults in the environment and do a presentation in class.",
      "5.2 Civic Engagement in Governance",
      "the learner should be able to:",
      "The learner is guided to:",
      " engage a resource person to",
      "discuss factors to consider in the",
      "Learning to learn: learners engage resource persons to discuss the factors to consider in making pre career choices for selection",
      "Responsibility: learners demonstrate responsibility while using digital devices/print materials to examine requirements for social",
      "Career Guidance as learners create and display charts with pathways and their respective requirements.",
      "English/Kiswahili language: learners will use writing and reading while composing and reciting poems on the pathway choices.",
      "discuss significance of pre-",
      "Creativity and Imagination: learners compose and recite poems creatively to highlight the value of pre-career support system.",
      "Responsibility: learners explore and use appropriate support system in the community",
      "Career Guidance: Learners engage a resource person to discuss significance of pre-career mapping for individual growth.",
      "All learning Areas: Learners explain the significance of pre-career mapping for individual growth."
    ],
    "source_file": "Social_Studies_Grade_9.pdf"
  }
}